{
    "Title": "The chimp paradox",
    "Author": "Steve Peters",
    "Year": "2012",
    "Notes": [
        {"text": ""}
    ],
    "Quotes": [
        {"text": "The Chimp model is a simplified model of the inner workings of the mind. Think of System 1 vs System 2 type of thinking."},

        {"text": "Preparing about the journey: (i) to be able to change or improve recognise you are not always functioning in the way you want to, (ii) accept that some things cannot be changed about ourselves, (iii) recognise the difference between possible and impossible dreams, (iv) managing emotions and thoughts is a skill, you must be willing to dedicate time to harness it, (v) you always have a choice, recognising this and making your choice is critical."},
        {"text": "Within the Chimp management model there are three brains - frontal, limbic, parietal - which form the psychological mind. This is not an scientifically accurate depiction, but rather a simplification."},
        {"text": "Brain scanning suggests that blood supply flows in the area of the brain that is being used. Thinking calmly and rationally directs the blood to the frontal area, while thinking emotionally and irrationally - with anger or distress - directs the blood to the limbic part."},
        {"text": "The limbic part of the brain is an (powerful) emotional machine that thinks independently from us, it's neither good nor bad but it has its own thoughts, worries and feelings. It is called the Chimp. You are not responsible for the nature of your Chimp, but you are responsible for managing it."},
        {"text": "The Chimp is built to serve a purpose, keep you safe enough to ensure the next generation, it has a personality of each own and can run your life for you."},
        {"text": "The frontal area is the real you, the Human. For the purposes of the Chimp model, the storage area of thoughts and behaviours is called the Computer. It contains information that both the Chimp and the Human have put into it so as to act instead of them in an automatic way or as a reference."},
        {"text": "The Chimp interprets information with feelings and impressions, it uses emotional thinking to decide on actions - guesses and fills in detail by assumptions based on hunches, paranoid feelings or defensive thoughts."},
        {"text": "The Human interprets information by searching for facts and establishing the truth. It seeks to find the truth and base its beliefs based on it. It uses logical thinking to form a plan of action."},
        {"text": "When the Human and the Chimp disagree, the Chimp typically gets control of thoughts and actions as it is more powerful."},
        {"text": "If you sometimes are wondering why or how can I be so irrational in my thinking, this is due to the Chimp in you. Emotions can shift ground quickly and so the Chimp's thinking is unstable and inconsistent."},
        {"text": "Characteristics of emotional thinking: (i) jumps to an opinion - it is fast to reach a conclusion and then seeks to back it up with evidence, (ii) thinks in black and white - it is not flexible, it is strict and rigid, it tends to limit the possibilities, (iii) it is paranoid / looks for danger, becoming prone to paranoia, it is catastrophic / overreacting and it is irrational / does not use sound reasoning, (iv) displays emotive judgement - judging others quickly and without mercy. So, the Chimp displays this behaviour, draws up conclusions and then creates a plan of action."},
        {"text": "Characteristics of rational thinking: (i) evidence-based, open-minded / can change its mind when presented with new data / evidence - does not personalise its viewpoint or belief and so does not become defensive when challenged, (ii) rational - uses common-sense to decide if something is realistic and feasible - ironically the Chimp prompts the Human by saying that something does not sound true, (iii) in-context and with perspective - tries to gain an understanding on what is happening and how important it is in the scheme of things, (iv) shades of grey and balanced judgement - appreciate that there might be several factors involved when we are trying to understand something and that we may not know all of them / less likely to judge harshly and more likely to see things in a spectrum or a distribution, (v) deducing things by going through steps, working with evidence and facts to reach a conclusion, following arguments by piecing together information, employing reasoning to work things out."},
        {"text": "The Chimp's agenda is survival (species perpetuation and self-survival). The Human's agenda is self-fulfilment, self-development, having a purpose and searching for meaning (all these mean different things for each person). The Chimp lives in the Jungle, the Human lives in the Society."},
        {"text": "The Chimp's operating mode is directed by: (i) instincts - fight, flight or freeze (provokes intense emotion to prompt quick action), nature throws in anxiety as a means to force the Chimp make a decision, (ii) drives - are strong urges or repeating behaviours with the intention to keep the species going (sex, ego, power, food, dominance, territory, parental instinct, security, inquisitiveness, troop), (iii) vulnerable stance - always on edge, looking for danger, gets easily agitated, upset or aggressive, typically emotional vulnerable, (iv) male/female Chimp specifics (in men the right amygdala has more right-sided brain connections, while in women the opposite which on average might make people more prone to certain feelings - I am not sure if this is bull), (v) body language - facial expressions, hand gestures, body posture play a role."},
        {"text": "The Human's operating mode is directed by honesty, integrity, compassion, conscience and remorse, law-abiding behaviour, responsibility / accountability for one's actions, self-control (delayed vs immediate gratification), sense of purpose, achievement. Managing the impulsive, emotional Chimp as an adult is one big challenge but will determine to a certain degree your success in life."},
        {"text": "Recognise who is in charge: whenever you have feelings, thoughts or behaviours you do not want or welcome, then you are being hijacked by your Chimp."},
        {"text": "Fixed process of how the brain receives information: all input goes to the Chimp first. All is good if both can work effectively (and also this is healthy because the Chimp tries to keep you healthy and safe, Humans don't always get it right, and Chimps don't always get it wrong), but problems arise when there is a disagreement (e.g. the Chimp gives a suggestion that is not appropriate)."},
        {"text": "The Chimp interprets what is happening and offers the Human an emotion and a suggestion of how to deal with the situation. Alas, the Human makes the final decision on whether to accept or reject this offer. Do not arm-wrestle with the Chimp, it will over-power you. You need to manage it, not to control it."},
        {"text": "How to manage the Chimp: (i) nurture it - keep it calm and happy, recognise the drive is present and then find a solution that will make the Chimp feel fulfilled in a way that is acceptable in the world in which you live, (ii) praise and recognise its effort, (iii) exercise it - allow it to express emotion so that it can calm down and become able to listen to reason or go to sleep, (iv) box it - address its fears and concerns by speaking to it, (v) give it a distraction or a reward."},
        {"text": "You must consider the needs of both the Chimp and the Human, as this side of you has also needs, e.g. having a sense of purpose, achievement, satisfaction, well-being."},
        {"text": "The Computer stores vetted actions, behaviours and thoughts for any situation the person might find themselves in. If you get the Computer to work well, all these vetted information can act as a stabilising force to your Chimp's behaviour."},
        {"text": "As a rough guideline, the Computer is 20x faster than the Human and 4x faster than the Chimp. The Computer contains: (i) Autopilots - positive, constructive or helpful beliefs or behaviours, (ii) Gremlins - unhelpful or destructive beliefs or behaviours that are removable, (iii) Goblins - unhelpful or destructive beliefs or behaviours that are fixed and extremely difficult to remove (usually formed in early childhood), (iv) The Stone of Life - values and beliefs that guide you or which you live your life on."},
        {"text": "Automatic functioning is based on learnt behaviours and beliefs, which the Computer can use and allow the Chimp and the Human from thinking and interpreting."},
        {"text": "Autopilot example: you are worthy just as you are, it is who you are that is being loved and respected and you don't have to achieve anything in order to get this. Goblin example: you are worthy as a child because of what you have achieved - it is what you can achieve in life that can make you worthy. Gremlin example: overreacting to situations, eating every time you feel like it but don't need to, beating yourself up, worrying about decisions and not making them, getting angry when you don't want to."},
        {"text": "The Stone of Life includes: (i) Truths of Life: your beliefs about how the world works, statements which you can prove true by using examples or experience, you have either worked them out or accepted them from somewhere (these are evidence-based), (ii) Values: judgement calls you have made and reflect moral and ethical principles that you intend to uphold (these are personal judgement calls not based on evidence), (iii) Life Force: it is what is important to you, what you believe life is all about and how it should be lived (e.g. imagine you have one minute left to live and your grandchildren ask you what it is they should be doing with their lives, what do you answer), (iv) Mindset: your perception about yourself, others, the world."},
        {"text": "Managing the Computer: Identify and replace Gremlins with Autopilots. Stop more Gremlins from creeping up to the Computer. Perfect your Stone of Life. Establish your Mindset."},
        {"text": "To find a Gremlin, think of a time when you experienced a negative emotion you did not want. Re-live the situation. See what you and others were doing. Focus on what you were thinking and ask yourself whether it was a truthful and helpful thought or not."},
        {"text": "To remove a Gremlin, you must put an Autopilot in its place. You do that by rehearsing it a number of times, thinking about it regularly until it becomes an automatic thought."},
        {"text": "How they work together: 1. input is danger or threat: (a) extreme danger: the Chimp takes over, (b) not severe danger: the Chimp looks into the Computer to see what is stored there, if the Computer reassures the Chimp, then the Human or the Computer act, if not the Chimp acts. 2. input is not danger or threat: (a) familiar situation: the Computer takes over, (b) if not familiar: handed over to either the Human or the Computer."},
        {"text": "How to change the default programming: (i) human intervention before the Chimp acts, (ii) add Autopilots to the Computer so that the Chimp refers to them and acts respectively."},
        {"text": "Personality is broadly defined as ingrained behaviours and responses that are predictable in a person. Generally, it is a mixture of that of the Chimp's and the Human's (and the Computer's content). Most Chimps are dominated by nature with some input from nurture, whereas most Humans are dominated by nurture with some input from nature. The Computer is a mix of the two. The person that you want to be, is the person you really are."},
        {"text": "Developing the Human and bringing out the best in you is about: (i) developing yourself, (ii) managing your Chimp and removing the Gremlins, (iii) communicating effectively, (iv) having the right people around you, (v) creating a world for yourself to live in, (vi) looking after yourself, (vii) getting quality in your life."},
        {"text": "Understand who is in front of you and how they think and work. If we accept this then we can work effectively with them (have realistic expectations) but we have to be willing to look at people with an open mind in order to do this."},
        {"text": "People can have different mindsets: (i) snow white - not responsible for their own decisions, happiness, victims of circumstance, life is tough and has always been, (ii) alpha wolf - the world belongs to them, others are in their world, compassion is seen as a weakness, challenges are met with aggression and hostility, never admit errors or being wrong. There are many possible mindsets, these are just two examples. Understanding the mindset of others, helps us to figure out how to deal with them."},
        {"text": "When meeting others, try not to make assumptions about them, not to have preconceived expectations of them and beware of prejudice. Always try to establish the facts before you make your assessment."},
        {"text": "First impressions also knows as the primacy effect. We pick up many things when we meet someone for the first time including their demeanour, attitude, appearance, intonation of their voice. If your Chimp gets this first impression wrong, it will take about seven more meetings with that person before it changes its mind."},
        {"text": "The Human searches for facts, truth and evidence before arriving to a conclusion. The Chimp first reaches a conclusion and then searches for evidence to support it."},
        {"text": "Don't make demands of others, but set the scene so that the Human in them can respond, rather than the Chimp."},
        {"text": "Accept the other person as they are, or walk away if you cannot accept their behaviours or beliefs. Invest a lot in those whom you care about. Remember that some people will never like you or be pleased with whatever you do and it may have nothing to do with you."},
        {"text": "Have a supportive group of people you can call your troop. You trust them to protect and stand by you. Chimps need troops (to feel safe), Humans would like to have them (to feel popular, or seek approval). Become personable and approachable but do not become personal with everybody."},
        {"text": "Troops are not fixed. They evolve. Let go."},
        {"text": "Remember to be there for your troops, but establish rules."},
        {"text": "Square of communication: right time, right place, right agenda, right way. Talking to the right person will save time, effort and emotional stress."},
        {"text": "The key to communicating well is to prepare yourself."},
        {"text": "Expressing assertiveness is to explain to someone what is acceptable in your world and what isn't and why. Being aggressive is expressing emotion and behaviours that are attacking in manner in order to convey your message. Assertiveness: removes emotion and chooses words carefully. Aggressiveness: full of emotion, evokes emotion in other person."},
        {"text": "Being assertive will more likely result in prompting the other person's Human to respond to you, rather than their Chimp (more likely to wake up when faced with aggressiveness)."},
        {"text": "How to be assertive: (i) Say to the person what you don't want, using the word I, (ii) Say to them how it is making you feel, (iii) Say to the person what you want, using the word I."},
        {"text": "The right time is about making sure that you have enough time to discuss and listen to the other person and express what you want to because if you don't have ime it may be difficult to return to the conversation later. The right place refers to having access either to a private place without noise or to neutral place where the Chimp won't become agitated. The right agenda is the Human's agenda (sensible outcomes) and not the Chimp's (win-lose mentality). Before entering a discussion, first find what it is that you want to discuss, don't get distracted and follow some other agenda. The right way means preparing yourself, having the right frame of mind and having thought about how you are going to approach and work through the conversation."},
        {"text": "Use the right body language (if you are crossing your arms you look defensive, if you are towering over someone you look intimidating, also micro-expressions - facial expressions occuring at high emotional states at a fraction of a second). Use the right speed in your voice. Speak steadily to help get your message across and help the other person to listen. Volume, emphasis and use of words - be aware of these (consider saying could instead of should, or and instead of but, would like instead of want etc). There are no hard and fast rules, try to think a bit deeper about the effect of your chosen words on others and the message you wish to convey."},
        {"text": "Preparing yourself for significant conversations: (i) make sure you are talking to the right person, (ii) make sure you have enough time to converse, (iii) make sure the place is appropriate for the discussion, (iv) make sure you have the right agenda in mind, (v) remove any unreasonable parts of your Chimp's agenda, (vi) approach the conversation in Human mode, (vii) use the right intonation, body language, voice speed, volume, ambience, (viii) help manage the other person's Chimp, (ix) clarify your own agenda and agree any common ground and outcomes aimed for, (x) try to meet the other person's agenda before your own (xi) meet your own agenda, (xii) summarise, smile and thank the other person."},
        {"text": "Unresolved conflict: (i) negotiation - approach the other person and try to find common ground by listening to each other, (ii) mediation - an independent person agreed by both of you comes in to help to resolve the differences, but doesn't decide, they only facilitate the conversation, (iii) arbitration - a person agred by both of you listens, arrives at a final decision on what will happen."},
        {"text": "The Chimp lives in the jungle, while the Human lives in the Society. Both have their own limitations. The real world is a fluctuating existence between two parallel worlds that change frequently. The right part of the jungle is where work and home environments are happy places to be."},
        {"text": "Stress is nature's way to tell you that something is wrong and that you need to act to put it right. It can be manifested as aggression, impatience, low mood, anxiety and so on. The body releases chemicals such as adrenaline and cortisol. It can be physical or psychological. You can either react to stress or deal with stress. An Autopilot is the way to manage sudden stress."},
        {"text": "Things to help you cope: Recognise that the Chimp is reacting to stress. Slow down your thinking. Step back from the situation. Get a perspective. Have a plan."},
        {"text": "What can you do practically to change things and what things do you have to accept and work with? Change what can be changed and control what it can be controlled. Don't remain passive."},
        {"text": "Laughing at yourself is one of the most effective ways to deal with stress. Diffusing stress: accept, move on, plan."},
        {"text": "Ironically, the biggest source of stress and problems will come from you and the biggest source of help for solutions will also come from you."},
        {"text": "In decision making, the stress is coming from the consequences not from the decisions. The Human is an adult and as an adult will deal with the consequences."},
        {"text": "Things change, you need to accept that. Do not try to keep everything the same. Do not have unrealistic expectations, you will get disappointed. Do not take on other people's problems you cannot own everyone's responsibilities."},
        {"text": "Do not blame others or circumstances, take a look at yourself."},
        {"text": "Chronic stress occurs when you do not deal with a situation and start to accept it as normal. A check-list: (i) always tired, short tempered, low mood, (ii) anxious or worrying for no apparent reason, (iii) lacking sense of humour, (iv) unable to relax properly, (v) paranoid ideas, (vi) a sense of urgency with everything, (vii) tearful or depressed, (viii) unable to face work or friends, (ix) small tasks seem large, (x) disrupted sleeping patterns."},
        {"text": "Write down the problems on paper and don't try to deal with them inside your head: (i) your perceptions and attitudes to the problem, (ii) the circumstances and setting for the problem, (iii) other people involved in the problem."},
        {"text": "Accept that you need to change and also remove any excuses and rationalisation as to why you can't remove stress."},
        {"text": "Causes of stress: (i) creating your own misery (own behaviours are causing the problem), (ii) red herrings (excuses that are stopping you from facing the real source of stress), (iii) mushroom syndrome (keep making things into worries), (iv) conflicting drives from within, (v) stress from circumstances or events (be proactive and change what you can or see if there is anyone to help you), (vi) stress arising from others."},
        {"text": "Stop beating up yourself and feeling guilty. Ask how not why, be constructive. Talk. Learn relaxation techniques. Delegate and share problems. Ask for help. Get perspective. Look beyond the problem to solutions. Be realistic. You are in charge of your own feelings and direction. Share your feelings with someone who cares. Do not hold on to worthless stones by giving up your freedom."},
        {"text": "To make the Chimp work your way: (i) Don't wade through treacle. Don't start with the problems and then try to find solutions. Instead, start with a blank state and define what you want. Then, what you know what it is you want, state how you will do it. (ii) Be proactive (making a plan in advance) and responsive (regrouping when your plan fails). Don't be reactive (giving up easily and taking the line of least resistance). (iii) Do not forget to Relax, Rest, Sleep."},
        {"text": "If you wake during the night, any thoughts and feelings you might have are from your Chimp and they are often disturbing, catastrophic and lacking perspective. In the morning, you are likely to regret engaging with these thoughts and feelings because you will see things different."},
        {"text": "Sometimes emotions are very irrational and you will have to work with them rather than constantly trying to understand them."},
        {"text": "When defining success, take into account both the Human's and the Chimp's perspectives. Define success before embarking on any new venture and work out what it means to you."},
        {"text": "Success maybe attainment, effort or both. It can be material, spiritual or personal. It can be partial or full."},
        {"text": "Realms. Yours and others. Respect the realm of others and make sure (be assertive) others will respect yours by letting them know the rules and then following them. You are a Monarch in your realm."},
        {"text": "Professional relationships: make sure that you are personable that is friendly, approachable and amenable, but not personal, that is you are not forming a friendship or more with the person."},
        {"text": "Preparation to undertake a task, Commitment, Ownership, Responsibility, Excellence: (i) motivation (this is a feeling based on emotion, it happens when there is a gain or reward, it is Chimp-driven) vs commitment (does not depend on feelings, it means following a plan even if you don't like it that day, it is Human-driven), (a) there is not point in starting if you have not thought through whether you will be able to commit to the challenge, (b) aspects of commitment: ask what is essential, significant or desirable then ask what are the challenges (hurdles - things not getting around of and require a coping strategy, barriers - things you can get around of with good planning, pitfalls - things that could be your downfall if you do not look out for them), (c) if you were given a huge sum of money to complete the task today, would you make it? if so there are no excuses and rationalisations if you don't do it (you still might not but there aren't any), (d) the biggest factor of success is for you to function at your best practically and emotionally, (ii) having ownership excites the Human and the Chimp and they are more likely to take something seriously when given it, (iii) responsibility means being disciplined enough to see the task through, it means being held accountable for the task (chances of success increase when we report back to someone with a progress report on how it is going), (iv) excellence refers to setting high but achievable goals, personal excellence is defined as doing your best regardless of the standard you achieve (a) personal excellence is achievable as it is totally up to you, you can still be disappointed with the level you achieve but you can hold your head up and say it was your best."},
        {"text": "An ideal leader is the person who develops the group and encourages them. It is based on the principle that people are doing their best and if they are failing then it means they need more support, guidance or development. People prefer to be encouraged, supported and rewarded than being beaten. There are standards to reach and benchmarks must be set and the consequences of not meeting them clarified. But if someone has tried their best with full support and failed to reach the benchmark then they can accept the consequences which may be unpleasant without suffering the stick. There is no place for a stick in society. There is a place for benchmarks and consequences of not reaching them which adult Humans learn to deal with."},
        {"text": "Happiness comes at a price because it usually takes an effort. We can look happiness in terms of having and being and these two aspects simply clarify the difference between what you have and who you are."},
        {"text": "The Chimp is never satisfied and whatever we can achieve they frequently dismiss it as low-key or worth-less."},
        {"text": "Possessions are similar to achievements. Happiness derived from possessions is short-lived. It is similar to getting something new, after a period of time happiness usually diminishes in value to you. Beware that you don't forget to cherish precious things that you have before they are gone."},
        {"text": "Self-image is how do you see yourself. The Chimp is very subjective and will change its mind frequently. The Human will try to give a subjective view and a balanced viewpoint of your attractive and unattractive aspects of you, through the lens of honesty, altruism, compassion. Self-worth is the value you put on yourself as a person. It is your choice of how you wish to weigh your worth, against what qualities. Self-esteem is how you compare yourself to others. The human is likely to say everyone is equal in value, even though we possess different skills and abilities. The Chimp would say everyone is at a different level and some people are better. Research suggests how you compare yourself to others has a major impact on your happiness levels. Self-confidence is what you believe you are capable of doing. How ever you choose to see yourself, think of yourself, believe in yourself, compare yourself, do not allow your Chimp to hijack you."},
        {"text": "Try to develop the habit of looking for solutions rather than dwelling on problems. You can choose how much a situation bothers you. You can choose how long you want to dwell on something unpleasant that has passed and how long you want to remain in that frame of mind. Learn to laugh at yourself and keep some sense of humour. Always be proactive in life, especially in relationships, decide what you want and then negotiate but don't allow yourself to become a passive victim. Try not to see battles in all you do but lifestyles. See in shades of grey and not black and white. Try to deal with the cause of a situation and not the symptom. Have realistic expectations. Admit your shortcomings and don't be afraid to say I don't know. Always try your best and deal with the consequences later. Changes within take time and effort. They usually happen gradually and often occur unnoticed by you, but not by others."}
    ]
}