{
    "Title": "Chip War: The Fight for the World's Most Critical Technology",
    "Author": "Chris Miller",
    "Year": "2022",
    "Notes": [
        {"text": "Semiconductors are foundational to the modern world, shaping international politics, the global economy, and military power. The development of the semiconductor industry has been a complex process influenced by a diverse range of actors, including corporations, consumers, ambitious governments, and the demands of war. It wasn't solely driven by technological advancement but also by geopolitical and economic factors."},
        {"text": "Leadership in semiconductor technology is seen as vital for a nation's security and its ability to compete in the global economy, influencing everything from technological innovation to industrial competitiveness. The chip choke highlights the precariousness of relying on concentrated supply chains."},
        {"text": "The Cold War provided significant impetus and direction for the nascent US semiconductor industry, driven by military needs and the space race.  The US initially held a dominant position in semiconductor technology, but this leadership has faced challenges and periods of intense competition from other nations, most notably Japan in the 1980s."},
        {"text": "The globalisation of the semiconductor supply chain, with a significant portion of manufacturing now located in Asia, particularly Taiwan, has created intricate interdependencies and potential vulnerabilities."},
        {"text": "The current status of the semiconductor supply chain ecosystem and manufacturing is characterised by high complexity, geographical concentration, and intense geopolitical competition. The production of a single chip involves a globally distributed network of companies, each specialising in a specific stage, from design (often in the US, but also increasingly in China) to manufacturing (dominated by Taiwan and South Korea), to assembly and testing (often in Southeast Asia or China)."}
    ],
    "Quotes": [
        {"text": "The US military provided crucial early funding and demand for integrated circuits, particularly for missile and space programs. During the Cold War, the US government, through initiatives like the Apollo program and the Minuteman missile project, became a major customer for early integrated circuits. NASA's trust in these new chips was an important stamp of approval, demonstrating their reliability even in harsh environments. This early government investment and procurement helped to nurture the nascent semiconductor industry and drive technological advancements."},
        {"text": "The Cold War created an immediate and significant demand for advanced electronics for military applications. The US military, facing the industrial-scale militaries of the Soviet Union and Communist China, relied on technology to maintain its edge"},
        {"text": "Agencies like DARPA (Defense Advanced Research Projects Agency) played a crucial role in funding early and speculative research in semiconductor technology, viewing it as vital to America's military edge."},
        {"text": "The Soviet Union's launch of Sputnik in 1957 caused a crisis of confidence in the US and spurred investment in science and technology. The space race, exemplified by the Apollo program, also drove the demand for smaller, lighter, and more reliable electronics, which integrated circuits provided. Charles Stark Draper's MIT lab chose Fairchild's integrated circuits for the Apollo program because they offered significant advantages in size, weight, and power consumption compared to discrete transistors."},
        {"text": "The Cold War rivalry extended to technological domains, including semiconductors. While the Soviets attempted to build their own semiconductor industry, their copy it strategy ultimately led to them falling behind the US in both innovation and mass production. The US benefited from a more dynamic ecosystem with collaboration between companies and access to advanced manufacturing technologies. The inadequacies of Soviet chipmaking by the 1980s meant their weapons systems remained less sophisticated."},
        {"text": "The US Air Force's need for a new, lighter, and more accurate computer to guide its Minuteman II missile, designed to carry nuclear warheads, proved to be a transformative contract for Texas Instruments (TI). Winning this contract in the early 1960s led to TI selling integrated circuits by the thousands, with shipments to the Air Force accounting for 60 percent of all dollars spent buying chips at that time. By 1965, 20 percent of all integrated circuits sold went to the Minuteman program."},
        {"text": "By the mid-1960s, the US military was deploying chips in various weaponry, from satellites to sonar and torpedoes. Bob Noyce of Fairchild Semiconductor acknowledged in 1965 that military and space applications would consume over 95% of the circuits produced that year."},
        {"text": "While the military provided the initial boost for the US chip industry, figures like Bob Noyce at Fairchild envisioned a larger civilian market. However, the early success and direction were significantly shaped by military needs. Noyce consciously decided to balance military contracts with developing technologies for the mass market, understanding that many military-required features would also have civilian applications."},
        {"text": "US policy during the Cold War deliberately fostered the growth of Japan's semiconductor and electronics industries and integrated them into a global network centred on the United States to counter the influence of the Soviet Union and communism. The US was willing to support Japan's technological advancement, even if it meant future economic competition, as a means of achieving its broader geopolitical objectives."},
        {"text": "US defence officials adopted a policy stating that a strong Japan is a better risk than a weak Japan. US policymakers ensured that Japanese firms like Sony could easily sell their products, including transistor radios, into US markets. This access was vital for the growth and financial success of Japan's burgeoning electronics industry. Trade publications like Electronics magazine recognized Japan as a keystone in America’s Pacific policy and argued for healthy commercial intercourse to prevent Japan from seeking economic sustenance elsewhere, such as with Communist China or the Soviet Union."},
        {"text": "US strategy involved letting Japan acquire advanced technology and build cutting-edge businesses, even beyond basic products like transistor radios. The aim was to create a symbiotic relationship where each country relied on the other for supplies and customers. By 1964, Japan had surpassed the US in discrete transistor production, while American firms led in advanced chips. This interdependence was intended to bind Japan to the American-led world order. While sometimes facing regulatory hurdles in Japan, companies like Texas Instruments (TI) were eventually allowed to establish plants there, with assistance from Japanese business leaders like Sony's Akio Morita. For US foreign policy strategists, more trade and investment links between the two countries tied Tokyo ever more tightly into a US-led system."},
        {"text": "Access to the vast US consumer market allowed Japanese firms like Sony to grow by selling transistor radios and other electronic goods that used semiconductors. Later, the Japanese government actively supported its chipmakers through subsidies and by encouraging collaboration among firms, exemplified by the VLSI Program. Japanese firms like Toshiba and Fujitsu engaged in a relentless struggle for market share, particularly in DRAM, often with the backing of cheap capital from Japanese banks."},
        {"text": "Japan became a major competitor in the semiconductor industry in the 1980s, causing concern in the US. Through a combination of strategic industrial policy and a focus on manufacturing excellence, Japanese companies made significant inroads into the global semiconductor market, particularly in DRAM (Dynamic Random-Access Memory) chips. This intense competition led to worries in the US about the decline of its own semiconductor industry and the potential implications for national security and economic competitiveness."},        
        {"text": "During the Cold War, and in its aftermath, complex supply chains were seen as a way to bind Asian nations to an American-led world order. By integrating countries like Taiwan, South Korea, and Japan into the production of semiconductors, the US aimed to foster economic interdependence and make these nations reliant on the American sphere of influence. US policy aimed to integrate Japan's semiconductor industry as a key component of its Cold War strategy in Asia, fostering a symbiotic relationship and reliance on US markets and technology."},
        {"text": "Asian nations entered the chip industry through a combination of factors: leveraging low labour costs for assembly, strategic government support and investment, facilitating technology transfer through partnerships and talent acquisition, and in some cases, capitalising on the geopolitical landscape and the strategic objectives of global powers like the United States."},
        {"text": "The relentless drive for economic efficiency and cost reduction inherent in capitalism naturally led to the dispersion of manufacturing across different countries with varying cost structures. Asia's vast pool of cheap labour attracted chipmakers looking for low-cost factory workers. US leaders, generally proponents of free markets and capitalist principles, implicitly supported this trend as it led to cheaper goods and potentially faster technological innovation."},
        {"text": "The increasing complexity of semiconductor technology required ever more specialised materials, machinery, and processes. These could only be supplied or funded via global markets, leading to a division of labour where different countries specialised in specific parts of the supply chain. While not always a direct policy, US leaders often favoured technological advancement and innovation, and complex global supply chains facilitated access to the best expertise and resources worldwide."},
        {"text": "Taiwan's entry was a deliberate strategic initiative led by figures like K. T. Li, who aimed to integrate the island economically with the United States. In the 1960s, Taiwan began to insert itself into semiconductor supply chains, primarily focusing on offshore assembly for American firms like Texas Instruments (TI) and National Semiconductor, attracted by the availability of cheap labour. Morris Chang played a key role in urging TI to set up a facility in Taiwan. This initial involvement in assembly allowed Taiwan to learn about more advanced technologies. Chang founded Taiwan Semiconductor Manufacturing Company (TSMC) in 1987 with strong backing from the Taiwanese government, pioneering the foundry business model. Taiwan also benefited from a pool of Taiwanese-American semiconductor engineers willing to contribute their expertise."},
        {"text": "South Korea's entry was driven by large conglomerates like Samsung, with strong support from the South Korean state, which identified semiconductors as a priority. Initially, South Korea aimed to become a cheaper source of supply for Silicon Valley firms looking to outmanoeuvre Japanese competition. Firms like Samsung actively sought technology transfer through joint ventures with US companies like Intel in the 1980s. South Korean companies also invested heavily in learning and mastering the complex manufacturing processes for memory chips, particularly DRAM, eventually overtaking Japan as the world's largest producer."},
        {"text": "Governments in Singapore and Malaysia offered support to companies like TI and National Semiconductor to build assembly plants, aiming to sop up unemployment and learn about advanced technologies. Cities in these countries, like Penang in Malaysia, were transformed by the electronics industry, providing numerous jobs in semiconductor assembly. While successful in attracting assembly work, Singapore's attempts to replicate Taiwan's success in advanced fabrication with companies like Chartered Semiconductor were less fruitful."},
        {"text": "In the post-Cold War era, particularly in the 1990s and 2000s, a new consensus emerged in Washington around the idea of running faster than America’s rivals."},
        {"text": "The prevailing thought was that the US could maintain its technological lead through continuous innovation, regardless of where manufacturing took place. This implicitly accepted and even encouraged globalised supply chains as US companies sought the most efficient production methods globally."},
        {"text": "This implicitly accepted and even encouraged globalised supply chains as US companies sought the most efficient production methods globally. Many officials backed the industry's calls for looser export controls, further enabling global supply chains."},
        {"text": "Continuous technological innovation, epitomised by Moore's Law, has been a driving force. The development of crucial technologies like FinFET transistors and the long and expensive journey towards Extreme Ultraviolet (EUV) lithography by companies like ASML have enabled the industry to keep shrinking transistors and increasing computing power."},
        {"text": "The discovery of the transistor at Bell Labs was the foundational step. Compared to the bulky and unreliable vacuum tubes used in early computers, transistors were significantly smaller, faster, and more energy-efficient switches. The independent inventions of the integrated circuit by Jack Kilby at Texas Instruments and Robert Noyce at Fairchild Semiconductor were revolutionary. The concept of fabricating multiple electronic components, including transistors, on a single piece of semiconductor material (silicon) eliminated the need for extensive manual wiring, leading to smaller, more reliable, and eventually cheaper circuits. The development and refinement of photolithography was critical for mass-producing integrated circuits with ever-shrinking features. This process involves shining light through patterned masks onto silicon wafers coated with photoresist chemicals to carve microscopic patterns on the silicon. Early techniques, like those used by Jay Lathrop, employed simple visible light. Over time, advancements in light sources (moving to ultraviolet and deep ultraviolet light), lenses, and photoresist chemicals allowed for the projection of increasingly smaller and more precise patterns, enabling the creation of transistors with nanometer-scale dimensions. The eventual move towards extreme ultraviolet (EUV) lithography, using a wavelength of 13.5 nanometers, represents a major leap in the ability to create even smaller features on chips."},
        {"text": "As transistors shrank to the nanometer scale, traditional 2D designs faced challenges like power leakage. The introduction of the FinFET (fin field-effect transistor) in the early 2010s marked a significant innovation in transistor structure. This 3D transistor design, where the semiconductor channel is placed on a fin-like structure, provided better control over the flow of electrons, overcoming leakage issues and allowing for continued miniaturisation."},
        {"text": "As the number of transistors on a chip grew into the millions and billions, specialised software tools (EDA) became indispensable for designing and simulating these complex circuits. These tools allow engineers to manage the layout of millions of microscopic transistors and predict their operation, which is crucial for creating increasingly dense and functional chips."},
        {"text": "As semiconductor technology advanced, the cost of building and maintaining state-of-the-art fabrication facilities (fabs) soared. Each new generation of technological improvement made fabs significantly more expensive. This high barrier to entry made it increasingly difficult for smaller companies to afford their own manufacturing capabilities. Owning a fab became so capital-intensive that only the largest players could realistically sustain it."},        
        {"text": "The founding and subsequent success of companies like Taiwan Semiconductor Manufacturing Company (TSMC) was a crucial enabler of the fabless revolution. Morris Chang, TSMC's founder, recognised that the rising costs of manufacturing equipment and R&D would favour companies with large production volumes. TSMC's business model, promising never to design its own chips and only to build them for customers, provided chip designers with a reliable and neutral manufacturing partner. This removed the risk that their manufacturing partner would steal their designs, a concern that had plagued earlier attempts at outsourcing. By outsourcing manufacturing, fabless companies could drastically reduce their startup costs. This lower barrier to entry allowed more entrepreneurs and startups to enter the semiconductor industry, focusing on creating innovative chip designs. Companies like Nvidia and Qualcomm excelled by concentrating on design, leaving the manufacturing to foundries like TSMC. Fabless firms gained access to the most advanced manufacturing processes offered by leading-edge foundries like TSMC and Samsung. These foundries invested heavily in next-generation manufacturing technologies, allowing fabless companies to produce state-of-the-art chips without the enormous upfront investment."},
        {"text": "Taiwan, and specifically TSMC, holds a particularly pivotal position, manufacturing almost all of the world's most advanced processor chips. South Korea is a dominant force in memory chip production. The Netherlands' ASML has a monopoly on extreme ultraviolet (EUV) lithography machines, which are essential for producing cutting-edge chips. This concentration makes the supply chain incredibly efficient but also highly vulnerable. The semiconductor industry underpins the modern global economy. Semiconductors are essential for virtually all modern electronics, from smartphones and PCs to automobiles, data centres, and advanced weapons systems."},
        {"text": "In recent decades, China's determination to build a self-sufficient semiconductor industry has emerged as a major force. Driven by national security and economic ambitions, the Chinese government has poured vast sums into subsidies and efforts to acquire technology. While facing significant challenges and US export controls, China's efforts are undeniably reshaping the global landscape. The growing strategic competition between the United States and China has placed the semiconductor industry at the forefront of geopolitical concerns. The concentration of advanced manufacturing in Taiwan, a region with complex political status, adds another layer of risk and has prompted discussions about supply chain resilience and potential onshoring or friend-shoring initiatives. The US has implemented measures to restrict China's access to advanced chip technology, creating a ‘chip choke’ on some of its leading tech companies"},
        {"text": "China spends more money each year importing chips than it spends on oil, highlighting their economic significance. Disruptions to the semiconductor supply chain can have significant economic consequences across various sectors, as evidenced by the automotive chip shortages in 2021, which led to substantial production cuts and revenue losses. The ability to produce advanced chips is increasingly seen as a key to economic prosperity, and countries are investing heavily to gain or maintain a competitive edge."},
        {"text": "The location of key semiconductor manufacturing hubs in earthquake-prone regions like Taiwan, Japan, and even Silicon Valley poses a constant threat of disruption. A major earthquake could severely damage or shut down critical fabrication facilities, leading to widespread shortages. While past earthquakes have caused temporary disruptions, the increasing reliance on a few key players amplifies the potential impact of such events."},
        {"text": "The semiconductor manufacturing process relies on a small number of companies that dominate crucial areas like chipmaking tools (e.g., ASML in EUV lithography), specialised chemicals, and design software. Disruptions affecting these choke points, whether due to geopolitical factors, trade restrictions, or company-specific issues, can have cascading effects across the entire supply chain."},
        {"text": "A silicon wafer: a circular piece of ultra-pure silicon, usually eight or twelve inches in diameter, out of which chips are carved."},
        {"text": "Transistor: This is a tiny electric “switch” that turns on (creating a 1) or off (0), producing the 1s and 0s that undergird all digital computing. Early chips contained only a few transistors, like the four in Fairchild Semiconductor's Micrologic. The number of transistors on a cutting-edge chip has grown exponentially over the decades."},
        {"text": "Moore's Law: This is the prediction made by Gordon Moore in 1965 that the number of components that could be fit on each chip was doubling annually as engineers learned to fabricate ever smaller transistors."},
        {"text": "Bits: These are the basic units of information in computing, represented as 1s and 0s, which are controlled by transistors. Early memory chips were measured by the number of bits they could store."},
        {"text": "Micrologic: This was Fairchild Semiconductor's new product announced in 1961, which was a silicon chip with four transistors embedded in it, marking an early step in integrated circuit technology."}
    ]
}