{
    "Title": "Command and control: Nuclear Weapons, the Damascus Accident, and the Illusion of Safety",
    "Author": "Eric Schlosser",
    "Year": "2013",
    "Notes": [
        {"text": "Context: the book stories the development of the US atomic arsenal following WW2 and describes the actions of the various entities and historical figures as well as events that took place and which decided. It’s great to read especially after you’ve watched the Oppenheimer film for some additional context. It focuses on an accident that happened in a Titan II facility in Damascus, Arkansas (September 1980)."},
        {"text": "Fractions will always be competing for power. The seeking of power by US military branches drove policy."},
        {"text": "Accidents are far easier to happen and it is a miracle there haven’t been any serious accidents throughout the years following WW2. The world has been amazingly close to an accident simply through the sheer scale of the atomic arsenal (close to 60k in mid-1980s, 13k in 2020s)."},
        {"text": "Even up until the 1990s the US did not have a reliable command and control or alert system."},
        {"text": "Atomic weapons policy is strongly related to game theory: deterrence, strike first advantage, decapitation."},
        {"text": "The race to develop greater weapons and the US - Soviet Union tensions were behind the two nations space initiatives.  Conducting research and building long range missiles was largely due to their need to stop being dependent on bomber aircrafts."},
        {"text": "The question of how to respond to a Berlin attack was a major issue: Should the US act first and not wait? If not who they should be targeting ? Is it all areas? Just military bases?"},
        {"text": "The problem with a-weapons is that even if you blow a big hit to the opponent, they still have the capacity to win because of the huge impact of this kind of weapons."},
        {"text": "In 1946, Oppenheimer favoured a scheme that would share technical information about atomic energy and promote goodwill, while the Soviet Union proposed that first the US should destroy all of its nuclear weapons and then an  agreement should be reached on how to prevent other nations from obtaining them. When the Genie is out of the bottle how do you put it back though?"}
    ],
    "Quotes": [
        {"text": "We are here to make a choice between the quick and the dead. Bernard Baruch told a gathering of United Nations delegates on June 14, 1946. We must elect World Peace or World Destruction."},
        {"text": "In 1948 the first emergency war plan directed at the Soviet Union, called HALFMOON, was approved. The plan called for 133 bombs to be dropped to the Soviet Union in case of an attack in Europe. The theory behind the counterattack was called the nation-killing concept."},
        {"text": "A country’s small arsenal may make them to act first out of fear. What is called a decapitation attach, to take out a a country’s leadership, may be the small-arsenal-country’s only hope to win such a war, thus making them more dangerous. A command and control system would be paramount to alert, classify incoming threats and respond. The first duty of such a system is to survive."},
        {"text": "After President Kennedy’s assassination, McNamara formally endorsed a strategy of Assured Destruction. The strategy planned to deter a Soviet attack by threatening to wipe out at least 30% of their population, 50% of their industrial capacity and 150 of their cities. Bombs of About 400 megatons would need to be detonated to achieve these objectives."},
        {"text": "When McNamara was informed by a reporter that the Soviets were hardening their silos to protect their missiles from an attack, he said ‘’Thank God’’. The move would improve crisis stability. Once the Soviets felt confident about their ability to retaliate after being attacked, they’d feel much less pressure to strike first. Leaving the cities of the United States and the Soviet Union vulnerable to annihilation, McNamara now thought, would keep them safe. The strategy was soon known as MAD: mutually assured destruction."},
        {"text": "The military distrusted the use of control and safety devices in atomic weapons. There was a trade-off between being able to detonate bombs and keeping them secure and safe in times of peace."},
        {"text": "After taking the new job, Peurifoy made a point of reading the classified reports on every Broken Arrow and major weapon accident, a lengthy catalog of fires, crashes, and explosions, of near misses and disasters narrowly averted. The fact that an accident had not happened, that a major city had not yet been blanketed with plutonium, offered little comfort. The probabilities remained unknown. What were the odds of a screwdriver, used to repair an alarm system, launching the warhead off a missile, the odds of a rubber seat cushion bringing down a B-52? After reading the report, Peurifoy reached his own conclusion about safety of America’s nuclear weapons: We are living on borrowed time."},
        {"text": "In 1971, a top secret Weapons Systems Evaluation Group study concluded that the warning assessment, attack assessment and damage assessment capabilities are so limited that the President may well have to make SIOP execution decisions virtually in the blind, at least so far as real time information is concerned. Another study a few years later determined that a nuclear attack would be imperfect, poorly coordinated, and largely uncontrolled, with confused and frightened men making decisions where their authority to do so was questionable and the consequences staggeringly large."},
        {"text": "What seems balanced and safe, in a crisis is often the most risky. Kissinger"},
        {"text": "The highest priority element of Reagan’s strategic modernisation program was the need to improve the command-and-control system. This system must be foolproof in case of any foreign attack, Reagan said. A handful of limited-war options would finally be included in the SIOP and the ability to fight protracted nuclear war depended on the survival of command-and-control facilities for long periods of time. The Pentagon also sought a system that will be able to communicate and transmit messages between civilian and military leaders, as well as between the US and NATO and the various branches of the American armed services."},
        {"text": "We escaped the Cold War without a nuclear holocaust by some combination of skill, luck and divine intervention, and I suspect the latter in greatest proportion. General Butler after reading the SIOP in 1991. Butler eliminated about 75% of the targets in the SIOP, introduced a targeting philosophy that was truly flexible and decided to get rid of the name SIOP. The US had no longer had a single, integrated war plan. Butler preferred a new title for the diverse range of nuclear options: National Strategic Response Plans."},
        {"text": "After studying a wide range of trivial events in a non-trivial systems, Charles Perrow (1979) concluded that human error wasn’t responsible for accidents (that take place in complex systems). The real problem lay deeply embedded within the technological systems, and it was impossible to solve: Our ability to organise does not match the inherent hazards of some of our organised activities. What appears to be the rare exception, an anomaly, a one-in-a-million accident, was actually to be expected. It was normal. Tightly coupled and interactive systems do not function in simple, linear ways like an assembly line. Such systems can have many components interact with each other thus making difficult to understand what is wrong and hard to stop or fix it."},
        {"text": "Do artifacts have politics? According to Langdon Winner, yes - the things we produce are not only shaped by social forces, they also help to mold the political life of society. Some technologies are flexible and can thrive equally well in democratic or totalitarian countries. But Winner pointed to one invention that could never be managed in a completely open, democratic spirit: the atomic bomb. As long as it exists at all, its lethal properties demand that it be controlled by a centralised, rigidly hierarchical chain of command closed to all influences that might make its workings unpredictable. Winner wrote: The internal social system of the bomb must be authoritarian; there is no other way."},
        {"text": "Secrecy is essential to the command and control of nuclear weapons, their technology is the opposite of open-source software. In the years since Congress passed the Atomic Energy Act of 1946, the design specifications of American nuclear weapons have been ‘’born secret’’, they are not classified by government officials, the are classified as soon as they exist. It is intended to keep valuable information away from America’s enemies, but an absence of public scrutiny has often made nuclear weapons more dangerous and more likely to cause a disaster."}
    ]
}