{
    "Title": "How to make friends and influence people",
    "Author": "Dale Carnegie",
    "Year": "1936",
    "Notes": [
        {"text":"Nearly profound knowledge on how to be a bit more wise in human relationships."}
    ],
    "Quotes": [
        {"text": "The goal: to think on your feet and express ideas with more clarity, more effectiveness, more poise, both in business interviews and before groups."},
        {"text": "Even in technical lines as engineering, about 15% of one's financial success is due to one's technical knowledge and about 85% is due to skill in human engineering, to personality and the ability to lead people."},
        {"text": "Education is the ability to meet life's situations. For the great aim of education is not knowledge, but action."},
        {"text": "The rapidity with which we forget is astonishing, the use of these principles can be made habitual only by a constant and vigorous campaign of review and application. There is no other way."},
        {"text": "We learn by doing. So to master these principles you need to apply them at every opportunity. Only knowledge that is used sticks in your mind."},
        {"text": "The engagement book idea is interesting. Gather notes from all your appointments and study them once per week. Ask what mistakes did you make, what did you do that was right and how could you have imporved your performance, what lessons can you learn from that experience."},
        {"text": "---> Fundamentals for managing people: 1. Don't criticise, condemn or complain. 2. Give honest and sincere appreciation. 3. Arouse in the other person an eager want."},
        {"text": "Don't criticise, condemn or complain: (i) Criticism is futile as it puts a person on the defensive and the person usually tries to justify themselves. It is dangerous because it wounds precious pride. It hurts the person's sense of importance and arouses resentment. Criticism always comes home, as the criticised person responds with a criticism of their own."},
        {"text": "Don't criticise, condemn or complain: (ii) Do not be so hasty to criticise (Lincoln's letter to Meade on Lee's escape), maybe put yourself in other people's shoes first. If you want others to improve, start from yourself (do not complain about the snow on your neighbour's roof when your own doorstep is unclean)."},
        {"text": "Don't criticise, condemn or complain: (iii) When dealing with people, let us remember that you are not dealing with creatures of logic. We are dealing with creatures of emotion, bristling with prejudices and motivated by pride and vanity. Benjamin Franklin's secret to success, I will speak ill of no man and speak all the good I know for everybody."},
        {"text": "Don't criticise, condemn or complain: (iv) Any fool can criticise, condemn and complain and most fools do. It takes character and self-control to be understanding and forgiving. A great man shows his greatness by the way he treats little men. Read again the Father forgets essay. God himself sir does not propose to judge a man until the end of his days. Why should I?"},
        {"text": "Give honest and sincere appreciation: (i) There is only one way to make people do something, they can only do it if they want to do it. Crude methods do not work in the long run and even if they did they have poor results. Freud said everything humans do springs from two motives the desire to be great and the sex urge. Dewey framed it as the desire to be important. Lincoln said everybody likes a compliment. The deepest principle in human nature is the craving to be appreciated. If you tell me how you get your feeling of importance I'll tell you what you are. That determines your character. It is the most significant thing about you. People may go to extreme lengths to receive appreciation (even insanity)."},
        {"text": "Give honest and sincere appreciation: (ii) Charles Schwab, my ability to arouse enthusiasm among my people is my greatest asset and the way to develop the best that is in a person is by appreciation and encouragement. Be hearty in your approbation and lavish in your praise."},
        {"text": "Give honest and sincere appreciation: (iii) Appreciation and encouragement is nourishment for the self-esteem. Appreciation is different from flattery and the difference is that one is sincere and the other is not. Flattery in the long run will get you to trouble and do you more harm than good. Flattery is cheap praise. Flattery is telling exactly one person what they think about themselves. Appreciation is the legal tender that all souls enjoy."},
        {"text": "Give honest and sincere appreciation: (iv) Honest appreciation gets results where criticism and ridicule fail. Figure out the other person's good points, then forget flattery, give honest and sincere appreciation."},
        {"text": "Arouse in the other person an eager want: (i) As action springs out of what we fundamentally desire, the only way on earth to influence other people is to talk about what they want and show them how to get it."},
        {"text": "Arouse in the other person an eager want: (ii) First thing is to get the other person's point of view and see things from their angle as well as your own. Just read pages 38-40 to see what this refers to."},
        {"text": "Arouse in the other person an eager want: (iii) Do not state what you want, but say how you can help and focus on their wants. If you demonstrate how your service or merchandise can help solve a problem, you won't have to sell, people will buy. And people like to feel that they are buying - not being sold."},
        {"text": "Arouse in the other person an eager want: (iv) Self-expression is the dominant necessity of human nature. If you have an idea do not try to enforce it down to others. Instead let others cook and stir the idea themselves. They will regard it as their own, they will like it and maybe eat a couple of helpings of it. First arouse an eager want."},
        {"text": "---> What to do for people to like you: 1. Become genuinely interested in other people. 2. Smile. 3. Remember that a person's name is to that person the sweetest and most important sound in any language. 4. Be a good listener and encourage others to talk about themselves. 5. Talk in terms of the other person's interests. Talk to people about themselves and they will listen for hours. 6. Make the other person feel important and do it sincerely."},
        {"text": "Become genuinely interested in other people: (i) People are interested in themselves. Whose picture do you see first in a group photo? Also, we are interested in others when they are interested in us. If we want to make friends let's put ourselves out to do things for people, things that require time, energy, unselfishness and thoughtfulness."},
        {"text": "Become genuinely interested in other people: (ii) Showing genuine interest for people wins you friends, customers, supporters. Obviously, interest has to be sincere and must pay off both for the person showing the interest as well as the person receiving the attention."},
        {"text": "Smile: (i) The expression one wears on one's face is far more important than the clothes one wears on one's back. A smile says I like you, you make me happy, I am glad to see you. (ii) Real smile, heartwarming smile, a smile that comes from within, the kind that will bring a good price in the marketplace. Smile when you talk on the phone, it comes through in your voice. (iii) People rarely succeed in anything unless they have fun doing it. Mental attitude manifests in how you feel and think. A man without a smile must not open a shop. For nobody needs a smile so much as those who have non left to give."},
        {"text": "Remember a person's name: (i) The average person is more interested in his or her own name than in all the other names on earth put together. Remember and call the name easily and you have paid a subtle and very effective compliment."},
        {"text": "Remember a person's name: (ii) Forget or mispell it and you have placed yourself at a sharp disadvantage. After all, libraries and museums owe their richest collections to people who cannot bear to think that their names might perish from the memory of the race. To recall a voter's name is statesmanship, to forget it is oblivion. Good manners are made up of petty sacrifices."},
        {"text": "Be a good listener and encourage others to talk about themselves: If you aspire to be a good conversationalist, be an attentive listener. To be interesting, be interested. Ask questions that others will enjoy answering. Encourage them to talk about themselves and their accomplishments."},
        {"text": "Make the other person feel important and do it sincerely: (i) Ask what it is about them that you can honestly admire? But you don't want to speak cheap praise, insincere flattery. (ii) The hallmark of good breeding, small courtesies such as Would you be so kind as to, Won't you please, Would you mind, Thank you. Emerson said Every man I meet is superior to me in some way. In that I learn of him."},
        {"text": "---> How to win people to your way of thinking: (i) The only way to get the best of an argument is to avoid it. (ii) Show respect for the other person's opinions, never say You're wrong. (iii) If you are wrong admit it early and emphatically. (iv) Begin in a friendly way. (v) Get the other person saying, Yes, yes, immediately. (vi) Let the other person do a great deal of the talking. (vii) Let the other person feel the idea is his or hers. (viii) Try honestly to see things from the other person's point of view. (ix) Be sympathetic with the other person's ideas or desires."},
        {"text": "Continued: (x) Appeal to the nobler motives. A person has usually two reasons for doing a thing, one that sounds good and a real one. To change people appeal to the nobler cause. Also consider the other person to be honest, fair, and sincere. (xi) Dramatise your ideas. Merely stating a truth is not enough. The truth has to be vivid, interesting, dramatic. Use showmanship to draw attention. You sort of shaping the path and motivating the elephant. (xii) Throw down a challenge."},
        {"text": "Arguments: (i) You can't win an argument because if you lose it, you lost it and if you win it, you lose it. The losing side will likely feel inferior and with a hurt pride. Hamlet, Why prove to a man that he is wrong? Is that going to make him like you? Why not let him save his face? He did not ask for your opinion. Why argue with him? (ii) I suppose this refers only to situations when you argue for the sake of arguing or for pointing out that the other person has erred. I wouldn't think it refers to situations when the goal is to make the optimal decision or similar. Still, a man convinced against his will is of the same opinion still (by the way this is misquoted see Samuel Butler). (iii) A misunderstanding is never ended by an argument but by tact, diplomacy, conciliation and a sympathetic desire to see the other person's viewpoint. (iv) When one yells the other should listen, because otherwise there is no communication, only noise and bad vibrations."},
        {"text": "Respect others' opinion: You can tell people they are wrong by a look or an intonation or a gesture just as eloquently as you can in words, and if you tell them they are wrong, do you make them want to agree with you? Never. For you have struck a direct blow at their intelligence, judgement, pride and self-respect. Galileo, you cannot teach a man anything, you can only help him to find it within himself. Chesterfield, be wiser than other people if you can, but do not tell them so. Alexander Pope, men must be taught as if you taught them not, and things unknown proposed as things forgot. Dr King, I judge people by their own principles, not by my own."},
        {"text": "Admit mistakes enthusiastically: There is a certain degree of satisfaction in having the courage to admit one's errors. It not only clears the air of guilt and defensiveness, but often helps solve the problem created by the error. By fighting you never get enough, but by yielding you get more than you expected. Admit your mistakes quickly and with enthusiasm."},
        {"text": "Begin in a friendly manner: (i) People do not want to change their minds, they cannot be forced or driven to agree with you. But they may possibly be led to, if you are gentle and friendly, ever so gentle and ever so friendly. It will be for you to consider, I trust you will not lose sight of, this may perhaps be worth thinking of. (ii) No bulldozing, no high-pressure methods, no attempts to force an opinion on others. Use a soft-spoken, quiet, friendly approach. (iii) The sun can make you take off your coat more quickly than the wind and kindliness, the friendly approach nd appreciation can make people change their minds more readily than all the bluster and storming in the world. Lincoln, a drop of honey catches more flies than a gallon of gall."},
        {"text": "Get them to say Yes: (i) Don't begin by discussing the ways in which you differ with someone, discuss the things both of you agree on. Say you differ in method but your purpose is the same. (ii) Get the other person to say yes, because if they first say no, it will be very difficult for them to erase themselves. Their pride demands they remain consistent, and so even if they do agree with you eventually they'll stick with what they had said at the beginning (anchor bias). If they had said no, it means that they are now in a state of rejection. The skillful speaker gets at the outset a number of yes responses. This sets the psychological process of the listeners moving in the affirmative direction. They are now forward moving, accepting and have open attitude. (iii) The Socratic method, get as many yes as possible and have the other person in a state of admission. He who treads softly, goes far."},
        {"text": "Let them do most of the talking: People know more about their business and problems than you, so let them speak them out, and ask questions.They won't pay attention to you while they still have a lot of ideas of their own crying for expression."},
        {"text": "Let them feel the ideas are theirs: It is wiser to make suggestions so that the other person slowly embrace an idea as their own. People believe more in ideas they have come up with than in ideas they were spoon fed to them. Lao-tse, The reason why rivers and seas receive the homage of a hundred mountain streams is that they keep below them. Thus they are able to reign over all the mountain streams. The sage wishing to be above them, must put himself below them, wishing to be before them, must put himself behind them. Thus, though his place be above men, they do not feel his weight, though his place is before them, they do not count it an injury."},
        {"text": "Attempt to see their viewpoint: People may be totally wrong, but they don't think so. Do not condemn them, any fool can do that. Try to understand them, only wise, tolerant, exception people even try to. There is a reason why the other man acts and thinks the way he does. Ferret out that reason and you have the key to his actions and perhaps his personality. Try honestly to put yourself in his place. Develop a tendency to see the world and think in terms of the other person's point of view."},
        {"text": "Be sympathetic to their ideas: (i) A phrase that eliminates arguments - ill feeling and creates good will, while making the other person listen attentively. I don't blame you one iota for feeling as you do, if I were you I would undoubtedly feel just as you do. You deserve very little credit for being what you are and people who come to you irritated, bigoted, unreasoning, deserve very little discredit for being what they are. (ii) Any fool can express the first thing that comes to his mind. Control yourself. Do not be a fool. Learn to find satisfaction in controlling your temper. The satisfaction for returning kindness for an insult. Sympathy the human species universally craves. The child eagerly displays his injury, or even inflicts a cut or a bruise in order to reap abundant sympathy.For the same purpose adults show their bruises relate their accidents and practice self-pity."},
        {"text": "Throw down a challenge: (i) The way to get things done is to stimulate competition. Not in a sordid money-getting way, but in the desire to excel. (ii) All men have fears, but the brave ones put down their fears and go forward, sometimes to death but always to victory. That is the way every successful person loves, the game. (iii) The chance for self-expression, to prove his or her worth, to win, to excel. The desire to excel, the desire to feel important."},
        {"text": "---> How to change people without giving offence or arousing resentment: (i) Begin with praise and honest appreciation. It is always easier to listen to unpleasant things after we have heard some praise or some good points. (ii) Call attention to people's mistakes indirectly. We're really proud of you for this, but you could have also done that. No. Use and instead of but. What this minor change does is to draw attention to the behaviour you want to change, indirectly and chances are that people will try to live up to expectations. (iii) Talk about your own mistakes, before criticising the other person. (iv) Ask questions instead of giving direct orders. Give suggestions and ask questions. Let the other person save his pride and feeling of importance. Bonus, this method stimulates creativity and allows the other person to be part of the decision making process, which make them more likely to follow along. (v) Let the other person save face. I have no right to say or do anything that diminishes a man in his own eyes. What matters is not what I think of him, but what he thinks of himself. Hurting a man in his dignity is a crime."},
        {"text": "Continued: (vi) Praise the slightest improvement and praise any improvement. Be hearty in your approbation and lavish in your praise. Like the flowers need the sunlight to grow, human need praise to strengthen their spirit. Abilities wither under criticism, the blossom under encouragement. (vii) Give the other person a fine reputation to live up to. If you want to improve a person in some respect, act as though that particular trait were already one of their outstanding characteristics. Shakespeare, assume virtue if you have it not. And it might be well to assume and state openly that other people have the virtue you want them to develop. Give them a fine reputation to live up to and they will make prodigious efforts rather than see you disillusioned."},
        {"text": "Continued: (viii) Use encouragement, make the fault seem easy to correct. (ix) Make the other person happy about doing the thing you suggest. Be sincere. Do not promise anything you cannot deliver. Forget about the benefits to yourself and concentrate on the benefits to the other person. Know exactly what it is you want the other person to do. Be empathetic. Ask yourself what is it the other person really wants. Consider the benefits that person will receive from doing what you suggest. Match those benefits to the other person's wants. Express ideas to show the benefits accrued to the other person."}
    ]
}