{
    "Title": "The Innovation stack",
    "Author": "Jim McKelvey",
    "Year": "2020",
    "Notes": [
        {"text":""}
    ],
    "Quotes": [
        {"text": "Entrepreneur (not simply a business person) is someone who is crazy, a rebel, an explorer, driven by more than just profit or even common sense. Remember, it used not to be a complement calling someone entrepreneur."},
        {"text": "Think of this prayer for a second -God, grant me the serenity to accept the things I cannot change, the courage to change the things I can, and the wisdom to know the difference-. The subset of those yet unsolved problems we have the power and courage to solve are our perfect problems."},
        {"text": "Perfect problems have a solution, but not a solution that exists yet. Inventing something new leads to the solving of the problem."},
        {"text": "You (and your team) is what makes a problem perfect for you to solve. Your capabilities, your passion and perseverance."},
        {"text": "The Walled City concept, all human knowledge encapsulated in a circle. What exists outside is for the brave ones to find out. Entrepreneurs is a word reserved for a person who does something truly new."},
        {"text": "Always include a -Reasons that X Will Fail- slide when asking for money from VCs. It might be a bit of funny but it also shows that you have thoroughly thought of all the angles and you are unafraid to confront the potential problems that will definitely arise. It also changes the vibe in these meetings."},
        {"text": "Copy what you can. Invent when you must. Square founders copied everything they could and invention was the last resort. They did the absolute minimum amount of invention to survive and in the process of doing that they ended up with over a dozen things that nobody had ever done before. Do not choose invention, choose a problem where invention is the only solution."},
        {"text": "If your backyard is 500 miles of desert, you don't need a fence. That is to say at some point the market or the customer it serves ends and most companies will not cross this border. It represents a standoff between the costs to produce a product and what people are willing to pay for it. This is where entrepreneurship begins, this area is uncontested ground and you should find a way to use it (if there is a problem to solve)."},
        {"text": "When you find yourself asking -Aha, this is why none has done this before- this is when entrepreneurship starts. Then, you will find that there will appear many sub-problems you would need to address in order to solve your perfect problem. For some of these, sufficient existing solutions will exist, and you should copy them. For others, you will have to innovate and invent a solution. Doing that several times will lead to building an innovation stack."},
        {"text": "Get the user experience right, for most companies it is part of their innovation stack. Create a moment of wow, get their full attention. Go cute, even if it means sacrificing some of the function. Basically, you can trade function with attention up to a point."},
        {"text": "Owning and controlling every aspect (design, development, manufacturing) of your product is more often than not key to rapidly innovate, iterate and come up with something stable."},
        {"text": "If you want to attract partners, you would have to grow the pie, not steal from them."},
        {"text": "Sometimes the key to an explanation is being quite long enough for the audience to catch up."},
        {"text": "Square up means to settle a debt or make something fair."},
        {"text": "Living outside the city walls involves solving problems with methods that had never existed before or not utilised in the same vein and that whatever is possible is also permissible. So, forced invention and scope of options, because time is running out and you need to figure it out. Fail fast and iterate."},
        {"text": "Solving one problem usually creates a new problem demanding a new solution and so on. The problem-solution-problem chain continues until you either succeed in solving all the problems or you fail and die. In the case, the collection of both interlocking and independent innovation required to solve all the problems that have arisen results in an innovation stack (which is a series of reactions to existential threats)."},
        {"text": "Free is a magic price. It is even more magical if you get something cool for it."},
        {"text": "Simplicity in its function, free online sign-up, free (cheap) hardware, no contracts involved (let them leave anytime), no live support, beautiful software (and hardware), fast net settlement, low (not lowest) price, no advertising, addressing fraud (through data science) and balance sheet accountability (adopt customers' risk of credit / default as their own). This is Square's innovation stack. I wonder if it can be generalised to other companies."},
        {"text": "Once outside the city walls, you cannot survive just by making a couple of changes to the traditional business model. You have to make an entire series of changes. Necessity mothers invention. You do not plan or want or aspire to innovate, you have to innovate. You have to do something to survive and grow that is. Each new thing affects other new things and they all evolve in series and in parallel."},
        {"text": "Allowing millions to do X for the first time, involves offering an easy sign-up and an amazing easy-to-explain cool product that people can vouch for and promote to others, all while eliminating frictions and paper contracts, keeping customer service and ad costs down because you have a low price."},
        {"text": "Beating starvation summons the second demon which is predation. In other words, if you manage to make a market other firms will try to take what you have built. Starvation is opening a coffee shop where nobody drinks coffee. Predation is Starbucks moving in next door."},
        {"text": "When everything you are doing, is being done for a good reason, you do not have to (should not) change anything when a predator comes knocking at your door. So, not just do nothing, do not do nothing different."},
        {"text": "Entrepreneurship cannot be taught, it has to be practiced. Indirect proof or negative space, the idea that when you want to focus on a subject, it is easier to focus on its opposite and the opposite of entrepreneurship, or innovation, is copying (because it works). Copying is almost always the best option because things that work are rare. When someone stumbles on a solution, it behooves the rest of us to do the same thing. Copying is so wired into our brains that when we stop copying we feel uncomfortable."},
        {"text": "The problem with copying is that nothing ever changes. And to advance, as a species, society or unit, we have to change. Most changes will fail though. But still some crazy people try to become entrepreneurs. Why? The money of course but is that it?"},
        {"text": "Perseverance (grit, determination, follow-through, work ethic, commitment) and Audacity (the reason you decided to leave the walled city) are the primary determinants or motivations of entrepreneurship. The audacity helps with the decision to step outside (or not) and begin something new and perseverance is something you need in order to follow through with your perfect problem. So, once you are outside, fear should fuel your survival instinct and force you leap from innovation to innovation otherwise you won't make it."},
        {"text": "Therefore, the decision to do something new ultimately comes down to how much audacity you have to tackle your perfect problem and how high is your fear of failure. How much do you care versus how much does it cost. If you care enough, failure be damned. So the driving force behind entrepreneurship is so personal, it is nearly impossible to study."},
        {"text": "Commitment can substitute for qualification."},
        {"text": "History is selection (or survivorship) bias in written form."},
        {"text": "Living within city walls long enough causes people to start believing that there is nothing beyond the walls. But an innovation stack to serve the smallest, poorest customers gives an exclusive access to a massive market."},
        {"text": "Being attacked can be very useful because in some cases it creates a warrior fighting spirit when people know they might go out of business next week they start fighting for the company's survival and help create an environment where innovation thrives."},
        {"text": "Innovation stacks are not only about tech (software or hardware). They can also be about processes, operations, logistics, people, culture, product, pricing and even marketing."},
        {"text": "Ask who comes first? Employees, customers or shareholders. The answer is employees, because if you treat them well, they treat you customers well and the result is happy shareholders."},
        {"text": "Focus on your customer, not on the competition."},
        {"text": "Timing is important. You do not only have to know the how, you also have to know the when. Do not ignore the when it is time to do something and when it is not."},
        {"text": "Sometimes you need to wait before you go to market with your venture, if a necessary component of your stack is missing or conditions are not supportive. But that does not mean you are not doing anything in the meantime. You should be working on the rest of your stack. Waiting for an element should not impede all the others. The longer the stack's elements have time to adjust to each other the better. Once the missing element becomes available, you will be ready to quickly capitalise on this before other firms can adapt."},
        {"text": "Right feels early. If the innovation feels right, it probably feels right to a hundred other people with the same idea, so it might be too late."},
        {"text": "Entrepreneurial companies get attacked. You have to grow to meet market demand, or risk losing everything to competitors. Other firms usually have more resources and a new market always draws companies who will try to take a piece."},
        {"text": "Experience helps but it is impossible have experience for anything that is truly new. So, be aware of the temporal components of the stack to make your venture more nimble."},
        {"text": "The more elements the innovation stack has the more difficult it is for other firms to copy it, but also for you to get it right. The stack should always evolve to incorporate feedback, as the company grows there should be an ever-expanding list of things to do."},
        {"text": "An entrepreneurial company in response to a competitive threat may appear to be doing nothing but it may simple be doing nothing different."},
        {"text": "The first group of customers, early adopters, have to be trained in the ways the firm operates and the product is used."},
        {"text": "Anchoring (tendency to rely heavily on the first piece of information acquired on a subject) and conservatism (tendency to insufficiently revise beliefs on the back of new evidence). These biases mean it can be easier to teach a new idea than to change an existing idea. Use these to anchor customers to your message and make them conservative towards competition."},
        {"text": "Curse of knowledge, the situation where we cannot appreciate the complexity of anything we are intimately familiar with. Do not fail to adequately explain how your system works."},
        {"text": "Linguistic gravity, people may ignore your message and stop listening if they think it is about something they already understand. Find ways to show the difference and that you offer something unique or truly new."},
        {"text": "Feedback failure, people are good in giving positive feedback and so if your message is confusing or garbled there is a good change you will never know because we have this tendency of hiding contempt or confusion. Ask for honest feedback or find out what people actually believe about your product."},
        {"text": "Processing difficulty effect, people tend to remember things better if they go through a struggle to learn them or when there is a moment of discomfort."},
        {"text": "Low not lowest. Low price stems from a company philosophy to constantly deliver maximum value to the customer. Entrepreneurs strive to keep price as low as possible, while still maintaining the quality of the overall experience. The lowest price in contrast requires comparison with another company. It is not an either-or problem (either low prices or good product but not both). Have low prices on high quality products, not the lowest price."},
        {"text": "Price can have a huge impact on culture because it is visible. Low price is the result of an innovation stack not its basis. Consistently low prices will help people to trust your company. Love is a side effect of trust."},
        {"text": "Markets are infinite, if they appear finite it is likely because we are incorporating the biases of the existing markets. Look beyond the wall, in the horizon. Entrepreneurs deliver the future, they are not disrupters (destroy the pie) they are market expanders (grow the pie)."},
        {"text": "To focus on disruption is to look over one's shoulder into the past. You do not have to study an industry when you are trying to expand a market solving a perfect problem, you only have to look at your (potential) customers"},
        {"text": "No man actually owns a fortune, it owns him. So why should a man pile a lot of money for somebody to spend after he is gone?"},
        {"text": "Humility allows us to take the first step into the unknown. To do something new requires us to summon the humility to admit our solution may not work and the audacity to try anyway. Hubris and overconfidence confine us to the world of already-solved problems. Nobody is officially qualified to be an entrepreneur."},
        {"text": "When you are afraid there are two ways to behave, you can do something or you can freeze. Do not freeze. Get comfortable with discomfort. If you can learn how totp perform a skill when you are afraid, it will be easier to repeat that performance when you are afraid. Fear is part of innovation. A natural and appropriate response to being unable to verify you are in a safe place. And while it is not possible to prepare for the feedback you will receive, it is possible to prepare for the way you will feel (very stoic)."},
        {"text": "Innovation has no experts. Do you feel unqualified to become an entrepreneur? Join the club, qualification comes only from successful experience. So after the perfect problem has been solved."},
        {"text": "When it comes to finding a perfect problem, no expert can tell you that something is a problem. A perfect problem is obvious. It is also something you deeply have to care about and this will give you the stubbornness to act and perseverance to withhold during the journey to solve it."},
        {"text": "It is not enough to choose a problem, the problem must choose you, in other words do not pick a problem you think other people have, pick a problem you know you have. When you find a perfect problem, you will no longer feel anger, you will feel energy. When you solve a perfect problem, the reward is internal. You do not have to hear good job from anyone, you will know you did well."},
        {"text": "The point in understanding innovation stack is to be less hesitant to act. Take that first step."},
        {"text": "The book cannot tell you how to create your stack, you will have to figure this out by yourself."}
    ]
}