{
    "Title": "Irrational exuberance",
    "Author": "Robert Shiller",
    "Year": "2000",
    "Notes": [
        {"text": ""}
    ],
    "Quotes": [
        {"text": "Financialmarkets are prone to bouts of irrational exuberance, which can lead to speculative bubbles. A speculative bubble is a situation in which news of price increases spurs investor enthusiasm, which spreads by psychological contagion, and in the process amplifies stories that might justify the price increases."},
        {"text": "Bubbles are not a new phenomenon. They have been occurring for centuries. Some notable historical bubbles include the tulip mania of the 1630s in Holland, the South Sea Bubble of the 1720s in England, and the stock market bubble of the 1920s in the United States."},
        {"text": "Bubbles are often fuelled by new era economic thinking. This is the belief that we have entered a new period of unprecedented economic growth and prosperity. For example, in the 1920s, people believed that new technologies, such as the automobile and the radio, would lead to a permanent boom. In the 1990s, people believed that the internet would revolutionise the economy and lead to a new era of prosperity."},
        {"text": "Bubbles can have a devastating impact on the economy when they burst. This is because they can lead to a sharp decline in asset prices, a loss of confidence, and a recession."},
        {"text": "The bursting of the dot-com bubble in 2000 and the housing bubble in 2007 had a significant negative impact on the global economy."},
        {"text": "Investors are not always rational. They are often influenced by psychological factors, such as fear, greed, and herd behaviour."},
        {"text": "Investors are often overconfident. They tend to overestimate their ability to predict the market and to underestimate the risks of investing."},
        {"text": "Investors are often influenced by the opinions of others. This can lead to herd behaviour, where investors buy or sell assets based on what others are doing, rather than on their own independent analysis."},
        {"text": "Investors are often more reactive to recent price increases than they are to fundamental factors, such as earnings or dividends."},
        {"text": "Investors often search for simple reasons to justify their investment decisions, even when those reasons are not supported by evidence. They may be more likely to invest in a company if they can easily understand the company's business model or if they have a personal connection to the company, even if the company's stock is overpriced."},
        {"text": "The news media can play a role in amplifying investor enthusiasm. For example, during a bull market, the media may focus on positive news stories about the market and downplay negative news stories. The media often promotes new era economic thinking. During a bubble, the media may give a lot of attention to experts who are predicting continued economic growth and prosperity."},
        {"text": "The media can also play a role in spreading fear and panic during a market crash. For example, during the crash of 1987, the media may have contributed to the sell-off by reporting on the decline in stock prices and by interviewing experts who were predicting further declines."},
        {"text": "The competition for eyeballs can lead the media to present debates on topics of little merit. The media's mission is to capture the attention of the public. While this might encourage them to cover a range of topics, it can also mean that they spread and reinforce ideas that are not supported by evidence."},
        {"text": "Irrational exuberance can lead to misallocation of resources. When asset prices are high, companies may be more likely to invest in speculative ventures, rather than in more productive investments."},
        {"text": "Irrational exuberance can lead to increased financial fragility. When investors are overconfident, they may be more likely to take on too much debt, making the financial system more vulnerable to a shock."},
        {"text": "Irrational exuberance can lead to a decline in savings. When people believe that they can get rich quickly by investing in the stock market or the housing market, they may be less likely to save for retirement or for other long-term goals."},
        {"text": "Individuals should focus on long-term investing and should not try to time the market."},
        {"text": "Institutions should adopt risk management strategies to limit their exposure to speculative bubbles."},
        {"text": "Governments should consider policies to encourage savings and to discourage excessive risk-taking."},
        {"text": "Defining and identifying bubbles is not an easy task. Although there is no single definition of a bubble, a key characteristic is the spread of investor enthusiasm by psychological contagion. A speculative bubble is defined as a situation in which news of price increases spurs investor enthusiasm, which spreads by psychological contagion from person to person, in the process amplifying stories that might justify the price increase and bringing in a larger and larger class of investors, who, despite doubts about the real value of the investment, are drawn to it partly through envy of others’ successes and partly through a gambler’s excitement. Identifying bubbles in real-time is extra difficult and even experts may struggle to determine when a market is truly in a bubble."},
        {"text": "Naturally occurring Ponzi processes: are feedback loops that amplify price increases in speculative markets. As prices rise, investors are drawn into the market, further driving up prices. This process can continue until some exogenous factor breaks the cycle. Ponzi schemes are often associated with fraudulent activity, but naturally occurring Ponzi processes are not necessarily fraudulent; they are simply a reflection of how markets work. For example, the rise of the housing market in the early 2000s was fuelled by a Ponzi process, as rising home prices encouraged more people to buy homes, which further drove up prices."},
        {"text": "Investor psychology can be influenced by seemingly irrelevant factors. People may anchor their expectations for future market returns on past price performance, even if that past performance is not indicative of future returns. Investors may also be influenced by the opinions of experts, even when those experts have no special knowledge of the market."},
        {"text": "Regulation can sometimes amplify financial cycles. Regulators are often slow to react to bubbles and that their actions can sometimes make bubbles worse."},
        {"text": "Several alternative investment strategies that may help individuals to manage risk and potentially outperform the market are investigated. These strategies include investing in a diversified portfolio of assets, investing for the long term, and hedging against specific risks. However, no investment strategy is guaranteed to be successful, and investors should always carefully consider their own individual circumstances before making any investment decisions."},
        {"text": "Robert J. Shiller's Cyclically Adjusted Price-Earnings (CAPE) ratio, a metric featured prominently in Irrational Exuberance, has faced some criticisms."},
        {"text": "Bill Gross argues that discussions of CAPE often fail to consider the very low interest rates that have persisted, especially since the 2008 financial crisis.  He suggests that when long-term government bond yields are very low, as they have been, investors may be less inclined to shift from stocks to bonds, even if the CAPE is high.  Therefore, a high CAPE might not be as concerning in a low-interest-rate environment. Gross points out that the U.S. bond market, with its low yields, may also have been experiencing a bubble.  He argues that, in evaluating the potential overpricing of the stock market using CAPE, it is essential to consider the possible overpricing of other markets, such as the bond market."},
        {"text": "Another criticism of CAPE comes from Jeremy Siegel. He suggests that a better measure of earnings could be used in the denominator of the CAPE. Siegel proposes a denominator based on a ten-year average of National Income and Product Accounts earnings adjusted with a divisor. However, Shiller notes that this proposal has a shorter available history and is vulnerable to issues associated with the divisor."},
        {"text": "These criticisms highlight the importance of carefully considering the context in which the CAPE is being used. While CAPE can be a useful tool for evaluating the long-term valuation of the stock market, it is important to consider other factors, such as interest rates and the valuation of other asset classes, when interpreting the ratio."},
        {"text": "In 2016, the CAPE for the United States stood at 26. This is higher than at any point in history except around 1929, 2000, and 2007, all of which were major market peaks. The high value of CAPE in 2014 is comparable to other periods in history when price relative to earnings reached high values. In June 1901, the price-earnings ratio reached 25.2. Referred to as the Twentieth Century Peak, this occurred after the US economy's emergence from the depression of the 1890s. In September 1929, the price-earnings ratio hit 32.6, the second highest ratio of all time. This was followed by a market tumble in which the real value of the S&P index dropped by 80.6% by June 1932."},
        {"text": "In January 1966, the price-earnings ratio reached a local maximum of 24.1, referred to as the Kennedy-Johnson Peak. This was followed by a period in which real earnings increased very little, and by December 1974, real stock prices were down 56% from their January 1966 value. While the high CAPE in 2014 warrants some concern, the ultimate outcome remains uncertain.  It's important to note that, as of 2014, the prices of alternative investments and long-term bond prices were also high, and short-term interest rates were nearly zero."},
        {"text": "What insights from financial history predict future market trends and crises? Drawing insights from financial history to predict future market trends and crises is a complex task, but certain recurring patterns and principles offer valuable guidance."},
        {"text": "Investor Psychology and Speculative Bubbles: Investors psychology plays a crucial role in market trends and crises. Periods of irrational exuberance, fuelλed by optimistic narratives and amplified by the media, often lead to speculative bubbles. These bubbles eventually burst, leading to sharp market corrections. The dot-com bubble of the late 1990s and the housing bubble leading up to the 2008 financial crisis are recent examples of this pattern. Understanding these psychological factors and recognising the signs of speculative excess is crucial for navigating future market cycles."},
        {"text": "Information Dissemination and Contagion: Τhe evolution of information channels, from newspapers to the internet, has dramatically accelerated information flow and influenced investor behaviour. While greater access to information can empower investors, it also increases the speed and reach of market sentiment and psychological contagion. This can lead to rapid shifts in market trends and exacerbate both booms and busts. The role of media coverage in amplifying the 1929 crash exemplifies this phenomenon. Recognising the potential for rapid information spread and its impact on market dynamics is important for anticipating future trends and managing risk."},
        {"text": "The Role of Precipitating Factors: Historical analysis reveals that market booms are often driven by a confluence of precipitating factors that shape investor sentiment. For example, the 1920s bull market was fuelled by technological advancements, a growing middle class, and easy credit. Similarly, the dot-com bubble was driven by the rapid growth of the internet and optimistic projections about its transformative potential. Political events, demographic shifts, and technological innovations can all act as precipitating factors. Identifying and analysng these factors in the present can provide valuable insights into potential future market trends."},
        {"text": "The Limits of Rationality:  Efficient markets theory, which posits that asset prices reflect all available information and are therefore rational, has been challenged by historical market events. The recurring emergence of speculative bubbles, such as the Twentieth Century Peak in 1901 and the peaks of 1929, 1966, and 2000, suggests that markets are not always driven by rational assessments of fundamentals. Recognising these limits of rationality and acknowledging the influence of psychological factors is crucial for understanding market behaviour and anticipating potential deviations from fundamental valuations."},
        {"text": "Reversion to the Mean: Historical data indicates a tendency for extreme market movements to revert to the mean over time.  What goes up a lot tends to come back down, and what goes down a lot tends to come back up. This principle suggests that periods of exceptionally high valuations are likely to be followed by corrections, and periods of extreme pessimism may present opportunities for market recovery. Understanding this historical pattern can inform investment strategies and encourage a long-term perspective."},
        {"text": "While precise predictions are impossible, history provides a framework for understanding market dynamics and navigating the inevitable cycles of boom and bust."}
 
    ]
}