{
    "Title": "Seven and a half lessons about the brain",
    "Author": "Lisa Feldman Barrett",
    "Year": "2020",
    "Notes": [
        {"text":""}
    ],
    "Quotes": [
        {"text": "Why did brains evolve? The reason is not because we had an innate need for thinking. Evolution favoured tasks that were performed more efficiently, not wasting energy and saving it for when it is needed the most. Energy efficiency is key for survival."},
        {"text": "Energy efficiency is like a budget. Body budgeting is performed without explicit effort and refers to tracking resources like water, salt, glucose as you gain and lose them. The scientific name for body budgeting is allostasis. This refers to automatically predicting and preparing to meet ones needs before they arise."},
        {"text": "When it comes to body budgeting prediction (anticipation of ones needs and acting in advance) beats reaction (responding to the environment cues). Creatures that predicted correctly most of the time, or made nonfatal mistakes and learned from them, did well. The best resources of information comes from our past actions."},
        {"text": "When a body includes intricate internal systems like a cardiovascular system with a heart that pumps blood, a respiratory system that takes in oxygen and eliminates carbon dioxide, an immune system to fight infections, allostasis is much more challenging. These complex bodies need more than a handful of cells to ensure that water and blood and salt and oxygen and glucose and cortisol and sex hormones are all regulated well to keep the body running efficiently. The needed a command certain. A brain."},
        {"text": "So, why did a brain like that of humans' evolve? The question is not answerable because evolution does not act with purpose - there is no why. But we can say what is the brain's most important job. It is not rationality, not emotion, not imagination, not creativity or empathy. It is to control your body - manage allostasis - by predicting energy needs before they arise so you can efficiently make worthwhile movements and survive. Your brain invests your energy in the hopes of earning a good return - food, affection, shelter, protection - so you can perform the nature's most vital task: passing your genes to the next generation."},
        {"text": "Any mental capacity is a consequence of a central mission to keep you alive and well by managing your body budget."},
        {"text": "The triune brain (the idea that the brain has three layers - one for surviving also called the lizard brain, one for feeling also called the limbic system and one for thinking mainly the neocortex), which had gained a lot of traction by the 1970s (Sagan, MacLean, Plato) is something that is refuted by scientific research."},
        {"text": "We know that nuerons from two species of animals can look very different but still contain the same genes, suggesting the same evolutionary origin. So, evolution does not add layers to the brain anatomy like geological layers of sedimentary rock. It turns out that as brains become larger, they re-organise."},
        {"text": "A rat's brain includes a single cluster of nuerons to sense the environment while a human's four such regions. What happened was not the addition of new regions through evolution rather as they brain expanded it was subdivided to redistribute its responsibilities."},
        {"text": "This arrangement - segregating and then integrating - leads to more complex brains that can control a larger and more complex brain. So parts that look different to the naked eye can be similar genetically and parts that differ genetically can look very similar."},
        {"text": "Reptiles and nonhuman mammals have the same kind of neurons that humans have. But human brains did not emerge from reptile brains by evolving extra parts for emotion and rationality. The biological building blocks are the same, what differs is timing. The manufacturing process (which has started post-conception) runs in stages and these stages last for shorter or longer durations in different species."},
        {"text": "So the real story is that during evolution certain genes mutated to cause particular stages of brain development to run for longer or shorter times, producing a brain with proportionally bigger or smaller parts. You don't have an inner lizard or an emotional beast-brain. There is no such thing as a limbic system dedicated to emotions. And your misnamed nocortex is not a new part, many other vertebrates grow the same neurons that in some animals organise into a cerebral cortex if key stages run long enough. Other animals are not inferior to humans. They are differently evolved."},
        {"text": "Rationality is better defined in terms of the brain's most important job: allostasis. Rational behavior from that view is making a good body-budgeting investment in a given situation."},
        {"text": "Many so-called facts about the brain are just metaphors: left / right side of your brain is logical / creative, the brain has a System 1 for quick instinctive responses and a System 2 for slower more thoughtful processing. Instead, the brain is a network, a collection of parts connected to function as a single unit. A brain network is not a metaphor, it's a description of the physiology of the brain, how it's structured and works."},
        {"text": "The brain has 128 billion individual neurons, each looking a bit like a tree (this is a metaphor) with branches at the top, a long trunk and roots at the bottom. When a neuron fires, an electrical signal races down its trunk to its roots. This signal causes the roots to release chemicals into the gaps between neurons called synapses. The chemicals travel across synapses to another's neurons bushy top causing the neuron to fire in turn. This is how information passes across neurons."},
        {"text": "Neurons chat constantly with each other. They chat mostly with those neurons closer to them yielding trillions of connections, but as always it's a balancing act between speed and cost. Neurons are organised in clusters (think of airports' hub and spoke system)."},
        {"text": "Faster change: neurotransmitters and neuromodulators (chemicals such dopamine, serotonin, glutamate) make it easier or harder to pass information across synapses or dial up/down their effects. Slower change: Neurons' plasticity is their ability to increase or decrease the density and strenght of their connections (e.g. learning something new, or through not practising some skill you previously acquired)."},
        {"text": "No neuron has a single psychological function though a neuron may be more likely to contribute to some functions than others. Any neuron can do more than one thing."},
        {"text": "Degeneracy: when different combinations of genes can produce the same result (e.g. eye color). In the brain, it means that your actions and experiences can be created in multiple ways (each time you feel joy your brain may construct that feeling with various sets of neurons)."},
        {"text": "Another advantage of a network organisation is that it has the ability to configure itself into an enormous number of distinct neural patterns. This is called complexity. A system has higher or lower complexity depending on how much information it can manage by reconfiguring itself. Complex brains are also more resilient, creative and flexible."},
        {"text": "A brain doesn't store memories, it reconstructs them on demand with electicity and swirling chemicals. We call this process remembering but it's really assembling. Each time you have the same memory your brain may have assembled it with a different collection of neurons (degeneracy)."},
        {"text": "The brain network may even extend into the gut and intestines where scientists have found microbes that communicate with the brain via neurotransmitters."},
        {"text": "Human brains are born under construction (as opposed to many other animals). They don't take on their full adult structure and function until about twenty five years have passed. A baby's genes are guided and regulated to a remarkable extent by the surrounding environment and its caregivers."},
        {"text": "Toys such as boxes and buildings train they baby's eye to see edges and corners. Cuddling and talking and making eye contact sculp the brain in many ways. Neurons that fir together more frequently cause gradual brain change (plasticity). These changes nudge they infant's brain toward higher complexity via two processes called tuning and pruning."},
        {"text": "Tuning strengthens the connections between neurons. Also the trunk like axons in the neuron becomes thicker with a coating of myelin that sort of helps information travel faster (how do I know this isn't a myth too? I don't really)."},
        {"text": "Less-used connections are pruned (weaken and wither). This is critical in developing the brain because babies are born with many more connections than they will ultimately use. An embryo creates twice as many neurons as an adult needs, and infants' neurons are more dense/bushier than in adult brains."},
        {"text": "Maintaining unused connections is costly metabolically speaking. Pruning helps with that and also develops room for more learning (i.e. more useful connections)."},
        {"text": "If an infant is crying for a long time and you don't check in regularly, the brain may learn that the world is unreliable and unsage while her body budget goes untended. In contrast, toddlers learn to tend their own body budget better when their caregivers create learning opportunities for them instead of hovering and taking care of their every need. A big challenge of parenting is knowing when to step in and when to step back."},
        {"text": "Sharing attention is the process over which you point out of what is important or interesting for the baby to focus on."},
        {"text": "Evolution doesn't have to encode all our wiring instructions to genes. It off-loads much of the job to the world around us including the other humans. We unknowingly wire the knowledge of our culture into our offspring after birth, for better or worse (cultural inheritance)."},
        {"text": "Little brains wire themselves to the world. When it comes to the brain, you can't make distinctions between nature and nurture. We have that kind of nature that requires nurture. Your genes require a physical and social environment - a niche filled with other humans who shared your infant gaze, spoke to you with intent, set your sleep schedule and controlled your body temperature - in order to produce a finished brain."},
        {"text": "Your brain predicts everything you do (or need to do)."},
        {"text": "The view of the world is no photograph, it's a construction of your brain that is so fluid and so convincing that it appears to be accurate but sometimes it's not. The brain tries to infer the meaning of the sense data and guess what to do about it. It asks itself what was the last time I encountered a similar situation and what did I do next. It then offers you some choices. The choice selected might be the one that corresponds to what's outside. However, sometimes it doesn't. You don't sense with your sense organs, you sense with your brain. You see some combination of what's out there in the world and what's reconstructed by your brain."},
        {"text": "This whole constructive process happens predictively. Your brain begins to sense the moment-to-moment changes around you before those light waves, chemicals and other sense data hit your brain. You don't experience it as such, but this is how your brain navigates the world."},
        {"text": "Prediction is a conversation the brain is having with itself. A bunch of neurons make their best guess about what will happen in the immediate future based on whatever combination of past and present that your brain currently recalls."},
        {"text": "If your brain has predicted well the neurons are already firing in a pattern that matches the incoming sense data. So the data in itself has no further use beyond confirming your brain's predictions. What you see, hear, smell and taste in the world and feel in your body in that moment are completely constructed in your head."},
        {"text": "Your brain is wired to initiate your actions before you are aware of them. That is kind of a big deal. After all, in everyday life, you do many things by choice, right? The brain launches the next set of actions based on past experience and current situation and it does so outside of your awareness. Your actions are under control of your memory and environment. Does this mean you have no free will?"},
        {"text": "Past experience is what matters. Your preferences you have developed from any early age matter. If you could reach back in time and change the first few times you experienced something then your brain would be predicting a different outcome today."},
        {"text": "Everything you learn today seeds your brain to predict differently tomorrow. These predictions drive your future actions."},
        {"text": "With practice you can make some automatic behaviors more likely than others and have more control over your future actions and experiences than you might think."},
        {"text": "Humans regulate each other's body budgets. Your brain becomes tuned and pruned as you interact with others. Without someone else helping to regulate our body budgets we bear an extra burden (think of metabolic cost)."},
        {"text": "As many brain regions that process language also control the insides of the body (including the heart rate, breathing, metabolism, the immune system etc), words literally can affect your body budgeting."},
        {"text": "Words are tools for regulating human bodies."},
        {"text": "Occasional stress can be like exercise, brief withdrawals from your body budget, followed by deposits create a stronger and better you. But if stress is prolonged, without much opportunity to recover, the effects can be more grave."},
        {"text": "Social stress is another factor, your body metabolises food in a way that adds 104 calories to the meal if you are exposed to social stress within two hours from the time you received the meal."},
        {"text": "Creativity and innovation could mean repeatedly failing and having the tenacity to pick yourself up and try again. This extra effort can create a real burden on your body, as the brain already burns 20% of your body's metabolic budget. If you're already heavily drained you're less likely to be a visionary spender."},
        {"text": "Another thing that takes a toll in body budgeting is being out of sync with the surrounding culture. Acculturation (an extreme version of plasticity) is when we are thrown in a new culture and our brain tries to tune and prune new behaviours and ways of conducting ourselves."},
        {"text": "Our brains create reality. It is all made up. Creating social reality is a likely consequence of the five Cs: creativity, communication, copying, cooperation and compression."},
        {"text": "Compression happens when a neuron summarizes or compresses all the information it receives from other neurons reducing redundancy, so that it can pass more efficiently that summary to other neurons. This is happening at a massive scale, starting from the cerebral cortex and transpiring information to highly connected neurons. This process enables sensory integration and this enables abstraction. It helps the brain to think abstractly and abstraction allows social reality (e.g. flowers are not just flower but a symbol for saying thank you or for wishing happy birthday)."},
        {"text": "Social reality is (making up abstract concepts, sharing them and thinking them into existence) powerful and has allowed humans to extend their domain from the physical into the imaginary world."}
   ]
}