{
    "Title": "Shoe Dog",
    "Author": "Phil Knight",
    "Year": "2007",
    "Notes": [
        {"text":"The adventures of Phil Knight, or how Nike was built."}
    ],
    "Quotes": [
        {"text": "Now, here you see, it takes all the running you can do, to keep in the same place. If you want to get somewhere else, you must run at least twice as fast as that. Lewis Carroll, Through the looking-glass."},
        {"text": "But Carter laughed in my face. When I laid out the list of places I wanted to see — Hawaii, Tokyo, Hong Kong, Rangoon, Calcutta, Bombay, Saigon, Kathmandu, Cairo, Instabul, Athens, Jordan, Jerusalem, Nairobi, Rome, Paris, Vienna, West Berlin, East Berlin, Munich, London — he rocked back on his heels and guffawed. Then Carter, still laughing, said: What a swell idea, Buck!"},
        {"text": "The junk merchant doesn’t sell his product to the consumer, he sells the consumer to his product. Burroughs probably."},
        {"text": "I marvelled at the concept of kensho, or satori - enlightenment that comes in a flash, a blinding pop. Sort of like the bulb on my Minolta. I liked that. I wanted that"},
        {"text": "Reality is nonlinear, Zen says. No future, no past. All is now."},
        {"text": "In every religion, it seemed, self is the obstacle, the enemy. And yet Zen declares plainly that the self doesn’t exist. Self is a mirage, a fever dream, and our stubborn belief in its reality not only wastes life but shortens it. Self is the bald-faced lie we tell ourselves daily, and happiness requires seeing through the lie, debunking it."},
        {"text": "To study the self, said the thirteenth-century Zen master Dogen, is to forget the self. Inner voice, outer voices, it’s all the same. No dividing lines."},
        {"text": "Especially in competition, victory, Zen says, comes when we forget the self and the opponent, who are but two halves of one while."},
        {"text": "Perfection in the art of swordsmanship is reached … when the heart is troubled by no more thought of I and You, of the opponent and his sword, of one’s own sword and how to wield it. All is emptiness: your own self, the flashing sword, and the arms that wield it. Even the thought of emptiness is no longer there."},
        {"text": "You cannot travel the oath until you have become the path yourself, said the Buddha, and I stood in awe before a path that twisted from the glassy lakes to cloud-ringed Mount Fuji, a perfect snow-clad triangle that looked to me exactly like Mount Hood back home."},
        {"text": "It’s a culture of indirection. No one ever turns you down flat. No one ever says straight out, no. They speak in circles, sentences with no clear subject or object. Don’t be discouraged, but don’t be cocky."},
        {"text": "I hated war, but I loved the warrior. I hated the sword, but loved the samurai. And of all the great fighting men in history I found MacArthur the most compelling. Of course he was deeply flawed. But he knew that."},
        {"text": "You are remembered for the rules you break. MacArthur."},
        {"text": "Why am I here? What is my purpose? I wondered. I waited. Nothing. Or else the silence was my answer."},
        {"text": "All is vanity, says the Bible. All is now, says Zen. All is dust, says the desert."},
        {"text": "Don’t go to sleep one night, wrote Rūmī, the thirteenth-century Persian poet. What you most want will come to you then. Warmed by a sun you’ll see wonders."},
        {"text": "If you get simple beauty and naught else, you get about the best thing God invented. Robert Browning."},
        {"text": "Don’t tell people how to do things, tell them what to do and let them surprise you with their actions. George Patton."},
        {"text": "You ask, What is our aim? I can answer in one word. It is victory, victory at all costs, victory in spite of all terror, victory … without victory, there is no survival. Churchill."},
        {"text": "I admire the eyes of persuasion. Goddess Athena in Oresteia. She was, in a sense, the patron saint of negotiators."},
        {"text": "Why was selling shows so different? Because I realised, it wasn’t selling. I believed in running. I believed that if people got out and ran a few miles every day the world would be a better place. People sensing my belief wanted some of that belief for themselves. Belief, I decided. Belief is irresistible."},
        {"text": "People reflexively assume that competition is always a good thing, that it always brings out the best in people, but that’s only true of people who can forget the competition. The art of competing, I’d learned from track, was the art of forgetting, and I now reminded myself of that fact. You must forget your limits. You must forget your doubts, your pain, your past. You must forget that internal voice screaming, begging, Not one more step! And when it’s not possible to forget it, you must negotiate with it. I thought over all the races in which my mind wanted one thing, and my body wanted another, those laps in which I’d had to tell my body, Yes, you raise some excellent points, but let’s keep going anyway."},
        {"text": "Life is growth. Business is growth. You grow or you die."},
        {"text": "If Blue Ribbon went bust, I’d have no money, and I’d be crushed. But I’d also have some valuable wisdom, which I could apply to the next business. Wisdom seemed an intangible asset, but an asset all the same, one that justified the risk. Starting my own business was the only thing that made life’s other risks — marriage, Vegas, alligator wrestling — seem like sure things. But my hope was that when I failed, if I failed, I’d fail quickly, so I’d have enought time, enough years, to implement all the hard-won lessons. I wasn’t much for setting goals, but this goal kept flashing through my mind every day until it became my internal chant: Fail fast."},
        {"text": "My little show company was a living, breathing thing, I said, which I’d created from nothing. I’d breathed it into life, nurtured it through illness, brought it back several times from the dead, and now I wanted, needed, to see it stand on its own feet and go out into the world. Does that make sense? I said."},
        {"text": "She did not like insecurity. She preferred security. She said it again. Security. That’s why she’d been drawn to accounting. It seemed solid, dependable, safe, a line of work she could always rely on."},
        {"text": "No matter what happened, he’d never lose his composure. Even at his most vulnerable, with me balancing him precariously at the top of some dark flight of stairs, he’d never lose touch with his essential philosophy: Don’t you dare feel sorry for me. I’m here to kill you."},
        {"text": "And what’s THIS. That’s a swoosh. The hell’s a swoosh? The answer flew out of me: It’s the sound of someone going past you."},
        {"text": "Everyone else bullshits, you guys always shoot straight. … Telling the truth. Who knew?"},
        {"text": "Onitsuka, cuts us off. A recession was underway. Gas lines, political gridlock. So, … in other words, … what I’m trying to say is, we’ve got them right where we want them. Let’s not look at this as a crisis. Let’s look at this as our liberation. Our Independence Day. We posted two million units in sales last year. That number is a testament to our ingenuity and hard work."},
        {"text": "I was persuasive because I was desperate. On selling the Futures program (commitment to buy for discounts)."},
        {"text": "Not a brilliant idea was ever born in a conference room. But a lot of silly ideas have died there. Fitzgerald. The last tycoon."},
        {"text": "Somebody may beat me, but they’re going to have to bleed to do it."},
        {"text": "I let them be, let them do, let them make their own mistakes. Because that’s how I’d always like people to treat me."},
        {"text": "The next morning we walked slowly up the steps of the US Senate Office Building … I had to pause. I thought of the Parthenon, the Temple of Nike. I knew that this, too, would be one of the seminal moments of my life. No matter how it turned out, I didn’t want to let it pass without embracing it, acknowledging it. So I stared at the columns. I admired the sunlight bouncing off the marble. I stood there for the longest time…"},
        {"text": "It seems wrong to call it business, to throw all these hectic days and sleepless nights, all those magnificent triumphs and desperate struggles, under that bland, generic banner: business."},
        {"text": "For some I realise business is the all-out pursuit of profits. For us business was no more about making money than being human is about making blood. Yes, the human body needs blood to manufacture red and white cells and platelets and redistribute them smoothly to all the right places. But the day-to-day business of the human body isn’t our mission as human beings. It’s a process that enables our higher aims and life always strives to transcend the basic processes of living — and at some point in the late 1970s, I did, too."},
        {"text": "When you make something, when you improve something, when you deliver something, when you add some new thing or service to the lives of strangers, making them happier, or healthier, or safer, or better, and when you do it all crisply and efficiently, smartly, the way everything should be done but so seldom is — you’re participating more fully in the whole grand human drama. More than simply alive, you’re helping others to live more fully, and if that’s business, all right, call me a businessman."},
        {"text": "As you risk everything, you must have a strong belief that something or someone greater than you is looking after you. That you’re being protected and you will be alright. I say by pure chance, but is it really? Am I allowed to think that some coincidences are more than coincidental? Can I be forgiven for thinking, or hoping that the universe, or some guiding daemon, had been nudging me, whispering to me? Or else just playing with me?"},
        {"text": "You measure yourself by the people who measure themselves by you. The bucket list."},
        {"text": "It’s never just business. It never will be. If it ever does become just business, that will mean that business is very bad."},
        {"text": "Because mothers are our first coaches."},
        {"text": "Seek a calling. Even if you don’t know what that means, seek it. If you’re following your calling, the fatigue will be easier to bear, the disappointments will be fuel, the highs will be like nothing you’ve ever felt."},
        {"text": "Sometimes knowing when to give up, when to try something else, is genious. Giving up doesn’t mean stopping. Don’t ever stop."},
        {"text": "Luck plays a big roles. Athletes get lucky, poets get lucky, businesses get lucky. Hard work is critical, a good team is essential, brains and determination are invaluable. But luck may decide the outcome. Some people may not call it luck. They might call it Tao, or Logos, or Jñāna, or Dharma. Or Spirit. Or God. Put it this way. The harder you work, the better your Tao. Have faith in yourself, but also have faith in faith. Not faith as others define it. Faith as you define it. Faith as faith defines itself in your heart."}
    ]
}