{
    "Title": "Switch: how to change things when change is hard",
    "Author": "Chip Heath, Dan Heath",
    "Year": "2010",
    "Notes": [
        {"text":""}
    ],
    "Quotes": [
        {"text": "Recognise that often what looks like a people problem is often a situation problem."},
        {"text": "All change efforts boil down to the same mission: can you get people to start behaving in a new way?"},
        {"text": "In our lives we embrace lots of big changes (marriage, having kids), while other behaviors are maddeningly intractable (smoking)."},
        {"text": "So there are hard changes and easy changes. Successful changes share a common pattern: (i) change the environment, (ii) change the heart, (iii) change the mind."},
        {"text": "The brain has two independent systems, the emotional side (instinctive, feels pain and pleasure) and the rational side (reflective or concsious system that analyzes and looks into the future)."},
        {"text": "Freud wrote about the selfish id and the concsientious superego (the ego mediates between them). Behavioral economists dubbed the two systems the Planner and the Doer."},
        {"text": "Plato said in our heads we have a rational charioteer who has to rein in an unruly horse that bearely yields to horsewhip and goad combined."},
        {"text": "The happiness hypothesis: the emotional side is the Elephant and the rational side is the Rider. Anytime the elephant and the rider disagree about which direction to go, the rider is going to lose."},
        {"text": "Changes often fail because the rider cannot keep the elephant on the road long enough to reach the destination. The elephant is hungry for instant gratification, while the rider's strength is to think long-term, to plan and to provide direction."},
        {"text": "On the other hand, the rider tends to overanalyse and overthink things, while the elephant is capable of compassion, sympathy, loyalty, caring. In addition, when you need to change things, the elephant is the one who gets thing done with its drive and energy."},
        {"text": "If you want to change things, you need to appeal to both. If you reach out to the rider but not to the elephant, you will have direction without motivation, and vice versa."},
        {"text": "Self control is an exhaustible resource. This is because self-supervision is harder and draining. Much of our daily behavior in contrast is performed automatically, on the auto pilot. This is why change is hard: when people try to change things you tend to rely less on the auto pilot behavior and more on self-supervision, wearing yourself out."},
        {"text": "On changing things, what looks like resistance is a lack of clarity. So if you want people to change, you must provide crystal-clear direction."},
        {"text": "So overall, for a change to happen, you have to direct the rider (what looks like resistance, is lack of clarity), motivate the elephant (what looks like laziness is exhaustion) and shape the path (or change the environment, what looks like a people problem is a situation problem)."},
        {"text": "To direct the rider: (a) look for the bright spots (understand what is working and how we can do more of it, find instances of positive things that have happened, good behaviours, successful efforts worth emulating), (b) script the critical moves (you cannot just set the vision and stay out of the details, any successful change requires a translation of ambiguous goals to concrete behaviours), (c) point to the destination (this is something that hits you in the gut, that you will be sold on and that it tackles the lost-in-analysis tendency the rider has)."},
        {"text": "The rider, will spin his wheels indefinitely (analysis paralysis behaviour) unless he's given clear direction. Show him where to go, how to act, what destination to pursue. Bright spots are very helpful for that."},
        {"text": "Relatively small changes can have a big impact on a big problem. This asymmetry (big problem, small solution) can throw the rider off his tracks with his predilection for analysis."},
        {"text": "People pay more attention to the bad stuff than the good ones (positive-negative asymetry), so the rider tends to focus on problem solving instead of focusing on how to scale successes."},
        {"text": "In times of change, when the autopilot doesn't work anymore and as choices proliferate, it becomes harder for the rider to decide and he resorts to the status quo."},
        {"text": "Provide directions on how to act. Decision paralysis is a real thing, more options even good ones paralyze us and as decision making require self-supervision it is a tax on the rider."},
        {"text": "When you want someone to behave in a new way, explain the new way clearly. Don't assume the new moves are obvious. Clarity dissolves resistance."},
        {"text": "To the rider, the analysing phase is often more satisfying than the doing phase, and that's dangerous for your switch. But when you point at a compelling destination, the rider starts applying his strength to figure out how to get there."},
        {"text": "You have to redirect the rider's energy to help navigate you to toward the destination. For that you need a gut-smacking goal, that appeals to both the rider and the elephant."},
        {"text": "In most organisations the goals lack emotional resonance (SMART goals - specific, measurable, actionable, relevant, timely - are the norm, e.g. my campaign will generate 1k leads by the end of the quarter)."},
        {"text": "Destination postcards (pictures of the future that hard work can make possibly) are inspiring and do double duty instead, they show the rider where you're headed and the elephant why the journey is worthwhile."},
        {"text": "A black and white goal - which leaves nowhere to hide - might help to provide a compelling vision / destination (e.g. gym every day)."},
        {"text": "Whatever the goal, it is important to marry your long-term goal with short-term critical moves. Back up the destination with a good behavioral script. Do not anticipate every turn in the road between today and the destination. Do not obsess about the middle, it is going to look different once you get there. Look for a strong beginning and a strong ending and get moving."},
        {"text": "To motivate the elephant, (a) find the feeling (knowing something is not enough to cause change, make people feel something, negative vs positive emotions), (b) shrink the change (small steps accumulate without spooking the elephant), (c) grow the people (consequences model vs identity model, cultivate a sense of identity and instil the growth mindset)."},
        {"text": "Sequence of change is See-Feel-Change, rather than Analyse-Think-Change, in almost all successful change efforts. Trying to fight inertia and indifference with analytical arguments is like throwing a fire extinguisher to someone who is drowning, the solution doesn't match the problem."},
        {"text": "In fighting for change you have to find the feeling. How to find the feeling and which feeling? if you need quick and specific action, then negative emotions might help (e.g. stone-in-the-shoe problem). But most situations require creativity and flexibility and ingenuity. They require positive emotions."},
        {"text": "Positive emotions are a bit of a puzzle. They are not always explicit and specific. Emotions such as joy, contentment, pride, love, interest tend to produce the same generic <<I am pleased>> expression known as the Duchenne smile."},
        {"text": "Negative emotions tend to have a narrowing effect on our thoughts. On the other hand, positive emotions are designed to broaden and build our repertoire of thoughts and actions."},
        {"text": "Joy for example provokes play, and play does not have a script. It makes us fool around, explore, become open to new things, learn and tackle new experiences, or acquire new skills. So to solve bigger more ambiguous problems we need to encourage open minds, creativity and hope."},
        {"text": "If you want a reluctant elephant to get moving, you have to shrink the change. For instance, quick wins even if not optimal, make it more likely that the person or team will believe in themselves and get motivated to continue in the right direction."},
        {"text": "Small steps without interruptions (without ons and offs) lead to a virtuous circle that will help make the switch. Engineering early successes is like creating hope. Hope is the elephant fuel."},
        {"text": "When you set small, visible goals and people achieve them, they start to get it into their heads that they can succeed. They break the habit of losing and begin to get into the habit of winning."},
        {"text": "Don't look for the quick, big improvement. Seek the small improvement one day at a time. That's the only way it happens and when it happens, it lasts."},
        {"text": "People make decisions through the consequences model (cost-benefit analysis, rational-based, analytical approach) or the identity model (asking Who am I, What kind of situation is this, What would someone like me do in this situation)."},
        {"text": "As identities are central to the way people make decisions, any change effort that violates someone's identity is likely to fail."},
        {"text": "People are receptive to change and they can assume new identities if these start from small beginnings. New identities can take root quickly but living up to them is hard."},
        {"text": "Any new quest, even on that is ultimately successful, is going to involve failure and the elephant really hates to fail. How do keep the elephant motivated when it faces such a long road?"},
        {"text": "You need to create the expectation of failure, not the failure of the mission itself, but failure en route. This notion describes the contradiction between what is called a fixed vs a growth mindset."},
        {"text": "Fixed mindset people tend to think their skills and abilities are static and they tend to avoid challenges. They are threatened by negative feedback and often fear that others will see their failure as an indication of their true ability and since they cannot change themselves this will set their status or position. After all people who are really good do not need to try that hard, right?"},
        {"text": "Growth mindset people believe abilities are like muscles and can be built up with practice. They tend to accept more challenges despite the risk of failure. They accept criticism as it ultimately makes them better. If you want to reach your full potential, you need a growth mindset."},
        {"text": "A growth mindset praises effort rather than natural skill. It can be taught and change lives. Failure is learning and because of that early failure is a kind of necessary investment."},
        {"text": "We will struggle, we will fail, w will be knocked down but throughout, we will get better and we will succeed in the end."},
        {"text": "There is no never, there is only No Yet."},
        {"text": "To shape the path: (a) tweak the environment (to change the behaviour change the situation), (b) build habits, (when behaviour is habitual, it is free and doesn't take the rider, look for ways to encourage habits), (c) rally the herd. (behaviour is contagious, help it spread)."},
        {"text": "Tweaking the environment is about making the right behaviour a little bit easier and the wrong behaviours a little bit harder. Do not focus on incentives (promises/threats) alone. If you change the path you will change the behaviour."},
        {"text": "To change the environment you can use self-manipulation (rearranging furnitures or taking out the queuing system)."},
        {"text": "You can use what is called the Haddon Matrix (pre-event, event, post-event) to establish processes that deal with failure across all three stages of a situation that a system can find itself in. Essentially you want to minimise bad behaviour or make it impossible."},
        {"text": "Shift habits by changing or tweaking the environment. If more things are being done on autopilot, the less burden you're putting on the rider and the easier it becomes to make the switch."},
        {"text": "Use action triggers (I am going to do this particular thing on specific that day and time or when some other activity kicks in). These have to be specific and visible enough that will interrupt your stream of consciousness so that you act differently."},
        {"text": "Use checklists. This sounds naive or relatively simple (but is it? a pilot's pre-flight checklist). Still very effective (doctor's checklist before surgery)."},
        {"text": "The elephant constantly looks to the herd for cues. We tend to follow others' behaviour. So make good behaviour contagious by spreading it."}
    ]
}