{
    "Title": "Thinking strategically",
    "Author": "Avinash Dixit and Barry Nalebuff",
    "Year": "1991",
    "Notes": [
        {"text": "The science of strategic thinking is rooted in game theory, which is the study of interactive decision-making. This book aims to translate complex game theory concepts into practical insights."},
        {"text": "Everyone is a strategist, whether they realise it or not, and that being a good strategist is better than being a bad one."},
        {"text": "The core idea is that strategic situations involve interactive decisions where your choices are affected by and affect the choices of others. This contrasts with situations where the environment is neutral."}
    ],
    "Quotes": [
        {"text": "Emphasis is given to the importance of anticipating how your rivals will respond to your actions. This is crucial for effective strategic decision-making. You must consider that your rivals are also strategic thinkers who will be trying to anticipate your actions. 'Looking forward and reasoning backward' is a method to analyse sequential moves."},
        {"text": "A dominant strategy is a course of action that outperforms all others no matter what other players do. Identifying dominant strategies can greatly simplify decision-making. However, even in situations with dominant strategies, like the Prisoner's Dilemma, cooperation is still needed to avoid mutually disastrous outcomes."},
        {"text": "When dominant strategies don't apply, the concept of equilibrium becomes important. An equilibrium is a situation where each player is doing what is best for them, given the actions of the other players (for instance price wars between businesses). Equilibrium does not necessarily mean the best outcome for all players or society as a whole. Equilibrium can be determined by whim or fad, not necessarily by a fundamental guarantee that the best choice will be made."},
        {"text": "Sequential Interaction: In this type of interaction, players make moves one after another, in a specific order. Each player, when it is their turn, must consider how their current actions will affect the future actions of others, as well as their own future actions. This involves a linear chain of reasoning, thinking, If I do this, the other player will do that—in which case, I will respond thus, and so on. Other examples of sequential games include chess and negotiations. The method to analyse these games is described as looking forward and reasoning backward."},
        {"text": "Simultaneous Interaction: Here, players act at the same time, without knowledge of the others' current actions. Although the players are not aware of the choices their rivals are making, they are aware that there are other active decision-makers, who are similarly aware, and so on. Each player must try to figure out the outcome by putting themselves in the shoes of all the other players. This involves a circular way of thinking: I think that he thinks that I think that... The book uses the Prisoner's Dilemma as an example of a simultaneous-move game. In such games, the strategic thinking involves not seeing the other's strategy but seeing through it."},
        {"text": "Strategic thinking is about outmanoeuvring an adversary, knowing that the adversary is trying to do the same to you. This applies to various contexts, including business, politics, sports, and even everyday life. The science of strategic thinking is called game theory, which is a relatively young science that provides many useful insights for practical strategists."},
        {"text": "A core principle in strategic thinking is to look ahead and reason back, especially in sequential move games. This involves anticipating the consequences of your initial decisions and using that information to calculate the best current move. This principle is so important that the book codifies it as Rule 1 of strategic behaviour."},
        {"text": "Rule 1: Look ahead and reason back. That is, anticipating the future responses of other players when making your current move. It means that you should analyse where your initial decisions will ultimately lead and use this information to calculate your best choice (a rule for sequential-move games)."},
        {"text": "Rules for Simultaneous-Move Games where players act at the same time, without knowing the others' current actions."},
        {"text": "Rule 2: If you have a dominant strategy, use it. A dominant strategy is one that outperforms all of a player's other strategies, regardless of the choices made by the rival. If you have a dominant strategy, you should choose it, without concern for your rival's choices. Additionally, if you do not have a dominant strategy, but your rival does, you should anticipate that they will use it and choose your best response accordingly. "},
        {"text": "Rule 3: Eliminate any dominated strategies from consideration, and go on doing so successively. A dominated strategy is one that is uniformly worse than some other strategy, no matter what the other player does. You should avoid your dominated strategies and assume your rivals will avoid theirs. By successively eliminating dominated strategies, you can simplify the game and identify the best course of action."},
        {"text": "Rule 4: Look for an equilibrium of the game. This rule applies when you have exhausted the possibilities of using dominant or dominated strategies. An equilibrium is a combination of strategies in which each player's action is the best response to that of the other. Given what the others are doing, no player wants to change their own move. This is often referred to as a Nash equilibrium. Finding an equilibrium strategy is a way of avoiding circular reasoning."},
        {"text": "Mixing Your Plays: It is important to mix your strategies unpredictably, rather than sticking to one choice, or rotating strategies in a predictable manner. This prevents your opponent from anticipating your moves and countering them effectively. Determine the correct proportions in which to mix your strategies."},
        {"text": "Strategic Moves: Strategic moves are actions designed to alter the beliefs and actions of others in a direction favourable to yourself. The distinguishing feature of a strategic move is that it purposefully limits your freedom of action. *Unconditional Moves: Involve a preemptive choice of action which is made before other players reach their decisions. *Threats: A response rule that specifies a punishment for those who fail to cooperate. *Promises: A response rule that commits you to reward others who cooperate with you."},
        {"text": "Credible Commitments: To make strategic moves effective, they must be credible, which requires taking supporting actions that make reversing the move too costly or impossible. The book offers an eightfold path to credibility, which are tactics designed to turn threats into warnings, and promises into assurances. A key part of building credibility is to establish and use a reputation for following through on commitments."},
        {"text": "Randomized Strategies: When there is no equilibrium strategy, players should use a randomised strategy and mix their moves. Each player should choose the mix of strategies which will make other players indifferent about their actions. These rules and insights provide a framework for thinking strategically in various situations. While the science of game theory is helpful, strategic thinking remains, in some ways, an art."},
        {"text": "Uncertainty about a rival's payoffs translates into an uncertainty about their actions. In sequential games, a player must understand what motivates their rival's actions. A player may be uncertain about their rival's payoffs at the end of the game, and therefore might be uncertain about how that rival will act."},
        {"text": "The Prisoner's Dilemma: a classic example in game theory that demonstrates the conflict between individual rationality and collective well-being. The dilemma shows how rational individuals, acting in their own self-interest, can produce a worse outcome than if they had cooperated. This is a situation where there are possibilities for mutual advantage as well as conflict of interest; both players would prefer mutual cooperation to mutual defection."},
        {"text": "When players interact repeatedly, they have the opportunity to build trust and establish patterns of behaviour, making cooperation more likely. If the game is played only once, the players will always have an incentive to defect, but the possibility of future interactions can lead to cooperation."},
        {"text": "A credible threat of punishment can make cooperation the more appealing choice, even in a situation where defection would be advantageous in a one-off interaction. When designing a punishment scheme to deter cheating and sustain cooperation, simplicity and clarity are of the utmost importance. If the rules of a punishment are too complicated, they are unlikely to be effective. Players must be able to easily and accurately calculate the consequences of cheating, if a punishment is to act as a good deterrent."},
        {"text": "Cooperation versus Zero-Sum Games: The Prisoner's Dilemma illustrates that many economic, political, or social games are different from games like football or poker, which are zero-sum games. In a zero-sum game, one person’s gain is another person’s loss, but in the Prisoner's Dilemma, there are possibilities for mutual advantage and cooperation."},
        {"text": "Strategic Moves are actions taken to alter the expectations or behaviour of your rivals. A strategic move is designed to change an opponent’s expectations about your responses to their actions, so that your rival changes their actions. These moves are distinct from tactical moves, which are simply actions taken within a given situation. There are three basic types of strategic moves."},
        {"text": "Commitments: A commitment is an unconditional move that restricts your future options and makes a threat or a promise more credible. It is a way to establish a response rule directly. When you make a commitment, you must take some supporting action to make that commitment credible. Threats: A threat is a conditional move that aims to deter undesirable actions from your rival by promising a negative consequence if the rival does not act in the way you want them to. Promises: A promise is a conditional move that aims to encourage desirable actions from your rival by guaranteeing a reward if the rival acts in the way you want them to."},
        {"text": "Credibility: For a strategic move to be effective, it must be credible. If your rival does not believe that you will carry out your threat or promise, then the move will have no effect. Credibility is achieved by taking a supporting action or a collateral action that reinforces the commitment."},
        {"text": "Changing the Game: Strategic moves are about changing the game by altering the incentives and expectations of other players. Without any effect on a rival's expectations, there will be no effect on their actions. By making a strategic move, you are not just reacting to a current situation, but actively shaping the future course of the game."},
        {"text": "More Complicated Strategic Moves: Allowing someone to make an unconditional move before you respond. Waiting for a threat before taking any action. Waiting for a promise before taking any action."},
        {"text": "Eight Devices for Achieving Credibility: Establishing a reputation. Writing contracts. Cutting off communication. Burning bridges. Leaving the outcome to chance. Moving in small steps. Using a team. Hiring an agent. These eight devices are underpinned by three principles: changing the possible actions, changing the possible outcomes, and using others to maintain commitment."},
        {"text": "The central point of the strategies is to change an opponent's expectations about your responses to their actions. This will fail if your opponent believes you will not carry out the threats or promises you make. An action that can be changed loses strategic effect against a rival who thinks strategically, as they will be on the lookout for tactical bluffing."},
        {"text": "If a large commitment is not credible, breaking it down into many smaller commitments can be a solution."},
        {"text": "Unpredictability as a Strategic Tool: In some situations, it is advantageous to be unpredictable in your actions to prevent your rivals from exploiting any systematic patterns in your behaviour. If your opponent can predict your actions, they can gain an advantage."},
        {"text": "Mixed Strategies: A mixed strategy is when a player does not settle on one particular strategy, but instead mixes their actions, choosing different strategies with a certain probability. It is not enough for a player to know that they should mix their shots, but they need to know how often to use each of their different options."},
        {"text": "Equilibrium in Mixed Strategies: If it is ever discovered that a player is not using the equilibrium random mix, the other player can exploit this. Only by playing one's equilibrium mixture can the danger of exploitation be avoided. The right proportions in which each player should mix their strategies is not always obvious, and a set of rules to determine when mixed strategies are needed and a method to find the right mixture."},
        {"text": "The Value of Weakness: Sometimes, deliberately appearing weaker can be a good strategy. If your opponent believes that you are weak in some area, they will focus their efforts in that area, giving you an opportunity to improve."},
        {"text": "Randomisation and Deception: It can be difficult to be truly random, and that a rival may be attempting to use a poor strategy in unimportant situations in order to deceive you into reacting in a way that will then allow them to exploit you in a more important situation."},
        {"text": "Brinkmanship as a Strategic Tool: brinkmanship involves deliberately creating a risk of a bad outcome in order to gain a strategic advantage. Brinkmanship is described as a way of scaling down excessive threats. It involves a willingness to go further than your opponent, increasing the risk of a negative outcome for both parties."},
        {"text": "The Control of Risk: It is essential to control the level of risk. This control involves understanding that the risk should be increased gradually and in steps, allowing room for retreat as well as escalation. The threatened party must be able to reduce the risk by agreeing to the brinkman's terms, and that there needs to be an assurance that the other party will stand down if compliance is given."},
        {"text": "The Role of Mixed Strategies: Probabilistic threats behind brinkmanship are developed using mixed strategies. Mixed strategies involve randomising your actions to keep your opponent guessing, making it more difficult for them to predict your moves and therefore giving you the advantage."},
        {"text": "Escalation and De-escalation: The calculation for each side is how far to proceed or retreat along this route, and that if you are willing to go further than your opponent, your brinkmanship will succeed."},
        {"text": "Failures of the Invisible Hand: Situations where individual self-interest does not lead to the best collective outcome. Uncoordinated choices can interact to produce a poor outcome for society. This is similar to the prisoner's dilemma where everyone might do the individually best thing, but this ends up worst from their collective viewpoint."},
        {"text": "Coordination Problems: Coordination problems can arise when people make choices independently, leading to undesirable outcomes for all involved. In these cases, everyone might do the individually best thing, but this ends up worst from their collective viewpoint."},
        {"text": "The Power of Path Dependence:  This concept explains that initial choices or events can have a disproportionate impact on later outcomes. As an example, the QWERTY keyboard layout became dominant despite not being the most efficient design."},
        {"text": "Voting Paradoxes: Voting can sometimes produce unexpected or undesirable results. The will of the majority can leave everyone worse off and that a sequence of majority votes can lead to an outcome that is worse than the starting point for everyone. Voting ignores the intensity of preferences."},
        {"text": "Strategic Voting: Voters can use strategic behaviour to influence election outcomes. When actions are taken in a piecemeal way, each step of the way can appear attractive to the vast majority of decision makers, but the end is worse than the beginning for everyone."},
        {"text": "Looking Ahead and Reasoning Back in Bargaining: To bargain effectively, one must anticipate the consequences of different offers and counteroffers."},
        {"text": "Sources of Bargaining Power: The ability to make the last offer can be a significant advantage in bargaining and a party's bargaining power gets smaller as the number of rounds increases. It can be better to be the one to give than the one to receive."},
        {"text": "The Role of Time: The value of an agreement can change over time. If the pie is melting while offers and counteroffers are being made, the two sides are motivated to reach an immediate agreement. The agreed division is based on what would happen if either side let the pie melt."},
        {"text": "The Power of Incentives: Incentives can be used to influence behaviour and achieve strategic goals. Understanding the underlying motivations of individuals is essential for designing effective strategies as people respond predictably to incentives. When rewards are not well aligned, people may engage in unexpected and even undesirable behaviour. Incentive systems should be designed with a clear understanding of the behaviour they are intended to elicit."},
        {"text": "The Importance of Contract Design: Contracts can be used to align the interests of different parties, but poorly designed contracts can lead to unintended consequences. If a contract specifies a fixed payment, the party receiving that payment will do their best to keep the costs down in the production process. If a contract is designed to pay according to the total costs, the party receiving the payment has no incentive to control the total costs, and that the incentives must be carefully aligned to bring the desired result."},
        {"text": "Adverse Selection and Moral Hazard: Arise from information asymmetries and can undermine the effectiveness of contracts. Adverse selection occurs when one party has more information than the other before a contract is signed, which can cause parties to avoid interactions with others to avoid being taken advantage of. Moral hazard occurs when one party has more information after the contract is signed, and can engage in risky behaviour that hurts the other party, but from which they will benefit. Contracts should be designed to overcome both the problems of adverse selection and moral hazard."},
        {"text": "Auctions as Incentive Mechanisms: Auctions can be used as effective mechanisms for resource allocation and price determination. There are different types of auctions, including sealed-bid auctions and Vickrey auctions. In a Vickrey auction, the winning bidder pays the second-highest bid. This can be a useful tool, but the winner does not know how much she will have to pay until the auction is over."},
        {"text": "The Limits of Redistribution: It is to redistribute wealth to create a more equitable society and that intended to help some, can create incentives for others to take advantage of the system. Programs and policies to redistribute wealth can be undermined by the incentives that they create, and that a perfect redistribution scheme will need to consider all possible ways that a given system could be abused."}

    ]
}