{
    "Title": "Thinking in bets",
    "Author": "Annie Duke",
    "Year": "2018",
    "Notes": [
        {"text":""}
    ],
    "Quotes": [
        {"text": "An overly tight relationship between results and decision quality is what the author refers to as resulting. Hint: you should learn to separate results from decisions."},
        {"text": "Bad results do not exclusively result from bad decisions alone. A thoughtful and meticulous decision making process can bring about a bad result."},
        {"text": "Thoroughly conscious ignorance is the prelude to every real advance in science (Maxwell). I don't know is not a failure but a necessary step towards enlightenment."},
        {"text": "What makes a decision great is not that it has a great outcome. A great decision is the result of a good process and that process must include an attempt to accurately represent our own state of knowledge. This is a variation of I am not sure."},
        {"text": "Good decision makers (and good poker players) have developed some comfort with being in an uncertain or unpredictable place. They know they will never be sure for anything and so they are trying to figure out how unsure they are."},
        {"text": "Experience helps with narrowing down the scenarios when you have the upper hand or with estimating the probabilities but you are never never ever sure."},
        {"text": "Redefine wrong: a super great poker player with a good size advantage over the other players sitting at the table, making significantly better strategic decisions will still be losing over 40% of the time at the end of eight hours of play. The world is structured to give us lots of opportunities to feel bad if we want to measure ourselves by outcomes."},
        {"text": "Being right feels like winning and being wrong feels like losing, so we need two favourable results for every unfavourable result just to break even emotionally."},
        {"text": "By treating decisions as bets, we recognise that we are deciding on alternative futures each with benefits and risks. We also recognise that there are no simple answers. Some things are unknown or unknowable. If we make explicit that decisions are bets we can anticipate and take protective measures when irrationality is likely to keep us from acting in our best interest."},
        {"text": "Hearing is believing. First we hear something, then we believe it to be true, only sometimes later if we have time we search it and vet it and then we determine whether it is true or false. Peaple are credulous creatures who find it very easy to believe and very difficult to doubt."},
        {"text": "Truth seeking (the desire to know the truth regardless of the beliefs we currently hold) is not naturally supported by the way we process information."},
        {"text": "Make an active effort to view the world through the lenses of wanna bet. You will realise that we are generally less sure than you thought and that practically nothing is 0% or 100%."},
        {"text": "Having learned a certain behaviour (lever-pulling) that results in a reward, the subject (human or rat) will only change its behaviour until after a very long number of tries of fruitless effort (a thousand tries of button-pushing)."},
        {"text": "Self-serving bias is a deeply embedded and robust thinking pattern (e.g. it is never my fault but someone else's or due to a situation)"},
        {"text": "Choosing between living in 1900 but being ultra rich and living now but having a median income, a vast majority would select the opportunity to soar above everyone else even if that means poorer healthcare and living conditions. A lot of the way we feel about ourselves comes from how we think we compare with others. This pervasive habit of mind impedes learning."},
        {"text": "But habits can be changed by shifting what it is that makes us feel good about ourselves. Be more open-minded and work towards a positive narrative driven by engagement and truth-seeking, striving towards accuracy and objectivity, giving others credit when its due, admitting when our decisions could have been better and acknowledging that almost nothing is black and white."},
        {"text": "Be a data sharer, that's what experts do. In fact, that's on of the reasons experts become experts as they have realised that sharing data is the best way to move towards accuracy cause it extracts insights from your listeners in the highest fidelity. Poker players sharing notes, full of details. The more details you provide the better the assessment of decision quality you get."},
        {"text": "In the truth seeking process, try this: omit the source of information (i.e. the person or organisation that you might generally not agree with) and see if what they say is true, accurate, makes sense etc."},
        {"text": "Use 'and' instead of 'but'."},
        {"text": "Ask what are the consequences of each of your options in 10 minutes, in 10 months, in 10 years. Become a time traveller."},
        {"text": "Work your way back from the outcome. Backcasting from a positive future."},
        {"text": "Good or bad outcomes can have an impact on your emotions that comprise the decisions going forward, so that you make emotionally charged, irrational decisions that are likely to result in more bad outcomes and so forth. This is tilt."},
        {"text": "If you have blown a recent event out of proportion and reacted in a drastic way, you are on tilt."},
        {"text": "To combat tilt, take some space and avoid making any decisions for a certain amount of time, until you can react rationally again."},
        {"text": "You also probably going to say something that you will regret so it's a good to avoid these situations for that reason too."}    
    ]
}