{
    "Title": "Thinking in systems",
    "Author": "Donella H. Meadows",
    "Year": "2008",
    "Notes": [
        {"text":""}
    ],
    "Quotes": [
        {"text": "A system is a set of things interconnected in such a way that they produce their own pattern or behavior over time."},
        {"text": "The system may be triggered or driven by outside forces, but its response to those forces is characteristic of itself and it is rarely simple in the real world."},
        {"text": "The system causes its own behavior. An outside event may unleash the behavior but that same event applied to a different system is likely to produce a different result."},
        {"text": "A system is comprised of many parts, elements, interconnections and a function or a purpose. A school is a system, so is a city, a factory, the national economy or the human body."},
        {"text": "Is there something that is not a system? Yes, anything without particular interconnections or function."},
        {"text": "A system is more than the sum of its parts, it may exhibit adaptive, dynamic, goal-seeking, self-preserving and evolutionary behavior."},
        {"text": "How to identify a system? (a) can you identify its parts, (b) do these parts affect each other, (c) do they produce an effect that is different from the effect of each part on its own and (d) does the effect or behavior persist in a variety of circumstances?"},
        {"text": "Elements can be physical or intagible things. Interconnections can be physical flows, reactions or importantly information flows."},
        {"text": "The least obious part is usually the function or purpose of the system. You can deduce this by looking at its behavior over time. The system's behavior reveals itself as a series of events over time."},
        {"text": "A system's behavior also determines its structure. Systems can be nested within systems."},
        {"text": "You can understand the relative importance of a system's elements, interconnections and purposes by imagining them changed one by one."},
        {"text": "Even with complete substitution of its elements, a system's behavior is slightly changed if its interconnections and function remain intact."},
        {"text": "Changing the interconnections can change the system heavily. A change in purpose, changes a system profoundly even if every element and interconection remains the same."},
        {"text": "A stock is the present memory of the history of changing flows within the system. A stock can increase by decreasing its outflow as well as increasing its inflow."},
        {"text": "A stock takes time to change as flows take time to flow. So, stocks act as buffers, lags, delays and sources of momentum in a system. Stocks allow inflows and outflows to be independent and temporarily out of balance with each other."},
        {"text": "When the sum of all inflows exceeds (is lower than) the sum of all outflows, the stock rises (falls). If these are equal the stock remains in a dynamic equilibrium at a certain level."},
        {"text": "A behavior that remains consistent and persists over time is likely the result of a control mechanism. This mechanism operates through a feedback loop (a closed chain of causal connections from a stock through a set of rules that are dependent on the level of the stock and back again through a flow to change the stock)."},
        {"text": "A feedback loop is formed when changes in the level of a stock affect the flows into or out of that same stock."},
        {"text": "A balancing feedback loop is an equilibrating or goal-seeking component of a system that is a source of stability and resistance to change."},
        {"text": "A reinforcing feedback loop is self-enhancing leading to exponential growth or runaway collapses over time. Applies to stocks that have the ability to reinforce or reproduce themselves."},
        {"text": "The information delivered by a feedback loop, even non-physical, can only affect future behavior. It cannot deliver the signal fast enough to correct the behavior that drove the current feedback."},
        {"text": "A person who makes a decision based on current feedback cannot change with its decision the behavior tha drove the current feedback, they can only affect the system's future behavior. So, there will always be delays in the system."},
        {"text": "Simple one-stock systems: (i) a stock with two competing balancing loops (thermostat), (ii) a stock with one reinforcing and one balancing loop (population and economy), (iii) systems with delays (business inventories)"},
        {"text": "Delays are pervasive in systems and they can determine their behaviour. A delay in a balancing feedback loop makes a system prone to oscillation. Changing the length of a delay may make a large change in the system's behavior."},
        {"text": "Complex behaviors of systems often arise as the relative strength of feedback loops shift, causing first one loop and then another to dominate behavior (shifting dominance)."},
        {"text": "Renewable resources are flow limited (they can support extraction or harvest indefinitely at a finite flow rate equal to their regeneration rate)."},
        {"text": "Nonrenewable resources are stock-limited, they can be extracted at any rate but the faster the extraction rate the shorter the resource's lifetime."},
        {"text": "In physical, exponentially growing systems, there must be at least one reinforcing loop driving the growth and at least one balancing loop constraining the growth, because no system can grow forever in a finite environment."},
        {"text": "System dynamics models explore possible futures and ask 'what if' questions. Model utility depends on how realistic the pattern of behavior expected by the model becomes."},
        {"text": "Properties of highly-functional systems: resilience, self-organisation, hierarchy."},
        {"text": "Resilience is generally the ability to bounce or spring back into shape - position after being pressed or stretched. There are limits to resilience. It can be considered as a plateau upon which the system can play, performing its functions safely. A resilient system has a big plateau, a lot of space to wander and elastic walls to bounce it back if comes near a dangerous edge."},
        {"text": "Systems need to be managed not just for productivity or stability but also for resilience (the ability to recover from perturbation, restore or repaire themselves)."},
        {"text": "Self-organisation is the capacity of a system to make its own structure more complex, to create new structures, to learn, diversify, and become more complex."},
        {"text": "Out of originally simple rules systems can grow enormous, diversifying crystals of technology, physical structures, organisations and cultures."},
        {"text": "Hierarchical organisations form from the bottom-up. The purpose of upper layers of the hierarchy is to serve those of lower layers. In such systems, relationships within sub-systems are denser and stronger than between sub-systems."},
        {"text": "If links within and between the system's levels are designed right, feedback delays are minimised, no level is overwhelmed with information, the system works with efficiency and resilience."},
        {"text": "When a sub-system's goals dominate at the expense of the total system's goals the resulting behavior is called sub-optimisation."},
        {"text": "Hierarchy must balance the welfare, freedoms and responsibilities of the sub-systems and the total system. There should be enough central control to achieve co-ordination toward the large system goal and enough autonomy to keep all sub-systems flourishing, functioning and self-organising."},
        {"text": "Why system surprise us? Everything we think we know about the world is a model. Our models do have a strong congruence with the world. Our models fall far short of representing the real world fully."},
        {"text": "System structure is the source of a system's behavior and it reveals itself as a series of events over time."},
        {"text": "Sources of surprise in systems: (1) Non linearities in systems produce shifting dominance of loops. (2) The world is a continuum, drawing boundaries around a system although important for clarity and sanity, may pose problems. Where to draw the boundary depends on the purpose of the discussion. (3) At any given time the input that is the most important to a system is the one that is most limiting. (4) Any physical entity with multiple inputs and outputs is surrounded by layers of limits. (5) There were always be limits to growth, either self-imposed or system-imposed. (6) A quantity growing exponentially toward a limit reaches that limit in a surprisingly short time. (7) Where there are long delays in feedback loops, some sort of foresight is essential. (8) The bounded rationality of actors in a system may not lead to decisions that further the welfare of the systame as a total."},
        {"text": "System traps: (1) Policy resistance, when various actors pull the system towards various goals. How to solve, let go, discuss with the actors and possibly redefine goals. (2) Tragedy of the commons, when a commonly shared resource is overused but no single user has an incentive to maintain it. How to solve, educate the users so that they understand the consequences of abusing the resource. (3) Drift to low performance, when past negative performance creates a bias and erodes goals. How to solve, keep performance standards absolute. (4) Escalation, when the state of a stock is trying to surpass that of another. How to solve, avoid getting in or refuse to compete thereby interrupting the reinforcing loop. Renegotiation is a likely outcome. (5) Success to the successful, when the system is set in such a way that the recent winners tend to be rewarded again and again. How to solve, through policies that level the playing field removing the advantages of stronger players or through diversification that would allow those who are losing the competition to get out of the game and start another. (6) Shifting the burden to the intervenor, when the solution to an issue reduces the symptoms but does not address the underlying problems (or kicking the can). How to solve, takes the focus off short-term relief and put it on long-term restructuring. (7) Rule beating, when actors are led to obey the letter of the rule without driving the system's goals. How to solve, redesign rules to release creativity in the direction of achieving the purpose of the rules. (8) Seeking the wrong goal, when the system has ill-defined goals. How to solve, specify goals that reflect the welfare of the system."},
        {"text": "Places to intervene in a system: (1) Transcending paradigms (the realisation that there is no true paradigm and that you can choose whatever you feel is right for you). (2) Paradigms, the mind-set out of which the system (its goals, structures, rules, delays, parameters) arise. (3) Goals, the system's purpose. (4) Self-organisation, the power to add, change, or evolve system structure. (5) Rules, incentives, punishments, constraints. (6) Information flows. (7) Reinforcing feedback loops. (8) Balancing feedback loops. (9) Delays, the lengths of time relative to the rates of system changes. (10) Stock and flow structures, physical systems and their nodes of intersection. (11) Buffers, the size of stabilising stocks relative to their flows. (12) Numbers, constants and parameters such as subsidies, taxes or standards."},
        {"text": "Systems wisdom: (1) Get the beat of the system, try to understand it. (2) Expose your mental models to the day light. (3) Honour, respect and distribute information. (4) Use language with care and enrich it with systems concepts. (5) Pay attention to what is important, not just what is quantifiable. (6) Make feedback policies for feedback systems. (7) Go for the good of the whole. (8) Listen to the wisdom of the system. (9) Locate responsibility within the system. (10) Stay humble, stay a learner. (11) Celebrate complexity. (12) Expand time horizons. (13) Defy the disciplines. (14) Expand the boundary of caring. (15) Do not erode the goal of goodness."}
    ]
}