{
    "Title": "Zero to one: notes on startups, or how to build the future",
    "Author": "Peter Thiel",
    "Year": "2014",
    "Notes": [
        {"text":""}
    ],
    "Quotes": [
        {"text": "Technology takes you from zero to one. Globalisation offers incremental improvements."},
        {"text": "If you are in an organisation where singaling that work being done becomes a better strategy for career advancement than actually doing work, then leave as this is a dysfunctional organisation."},
        {"text": "A lone genius cannot build a new industry the same way as he would create art or literature masterpieces. Startups operate on the principle that you have to work with other people to get stuff done. But keep the team small so you can actually make things."},
        {"text": "A startup is the largest group of people you can convince of a plan to build a different future. Small size affords nimbleness, but more importantly the space to think. To question received ideas and rethink business from scratch, that is what a startup is for."},
        {"text": "Principles: Better to risk boldness than triviality (vs make incremental advances). A bad plan is better than no plan (vs staying lean and flexible). Competitive markets destroy profit (vs improve on competition). Sales matters just as much as product (vs focus on product, not sales)."},
        {"text": "Under perfect competition, in the long run no company makes an economic profit. A monopoly owns its market, so it sets its own prices, producing at the quantity and pricing that maximises profits."},
        {"text": "If you want to create and capture lasting value, do not build undifferentiated commodity-like businesses."},
        {"text": "Monopolies lie to conceal their identities and to protect themselves from being audited, scrutinised and attacked. Non-monopolists are biased to understate the scale of competition they face, defining their market extremely narrowly so that it appears they dominate it."},
        {"text": "Competitive ecosystems push people toward ruthlessness or death. Monopolist businesses have the latitude and afford to care about their workers, products and impact on the wider world. Monopoly profits allow a business to transcend the daily brute struggle for survival."},
        {"text": "Are monopolist profits a bad thing or like rent-seeking and do they come at the expense of society? Yes, but only if the world is a place where nothing changes and innovation cannot happen or alter things."},
        {"text": "In a static world monopolists are rent collectors. Creative monopolists give customers more choices by adding abundance to the world."},
        {"text": "Monopoly profits should be the reward for creating greater abundance, not artificial scarcity. The same reward is what drives innovation and an incentive to create, make long-term plans and finance research to make the world a better place."},
        {"text": "In business, equilibrium means stasis and stasis means death. Every new invention takes place far from equilibrium. Every business is successful exactly to the extent that it does something others cannot, solving a unique problems."},
        {"text": "Winning is better than losing but everybody loses when the war isn't one worth fighting for. If you do have to fight, fight to win. Do not throw any punches or strike hard and end it quickly. Human nature dictates people to fight even for shallow things because it makes them feel like heroes but this is disastrous in business."},
        {"text": "Businesses are evaluated by their ability to generate cash flows in the future. Low growth businesses derive most of their value in the near-term. High growth businesses like tech companies expect to derive most of their value from the long-term (10-15 years in the future) and usually tend to have losses in their near term as they invest in building valuable things."},
        {"text": "Durability is as much as important as growth. Do not forget to ask whether this business will still be around in 10 years. Think critically about the qualitative characteristics of any business."},
        {"text": "In general, monopolies are built upon proprietary technology, network effects, economies of scale and branding."},
        {"text": "Proprietary technology makes your product highly difficult or impossible to replicate. This is a synonym for at least 10x improvement to the closest substitute in some important dimension. Anything less would be a hard sell as will be perceived as marginal. You can either build something new (clearest way), radically improve on an existing solution or you can achieve a superior integrated design."},
        {"text": "Network effects make a product useful as more people use it. To reap network effects the product needs to be valuable to its first users when the network is small (you need to start with especially small markets)."},
        {"text": "A monopoly business gets stronger the bigger it gets, as the fixed costs are spread out to greater sale quantities. Software businesses have close to zero marginal costs for producing another copy of the product. Build the potential for scale from the very beginning (first design)."},
        {"text": "A strong brand is a powerful way to claim a monopoly, but it is dangerous to begin with brand rather than substance and no company can be build on branding alone."},
        {"text": "How to built a monopoly: (i) start with a very small market and gain a large share of that market (a small group of people, concentrated together and served by few or no competitors), (ii) once you dominate a niche market gradually expand into related and slightly broader (adjacent) markets, (iii) do not disrupt (disruption not only attracts attention and competition but also it hinders the process of building new stuff if you start obsessing about battling incumbents)."},
        {"text": "Moving first is a tactic, not a goal. The real goal is generating cash flows, so it is much better to be the last mover, that is to be the one who makes the last great development in a specific market that lead to monopoly profits. To succeed, study the endgame before anything else (Jose Raul Capablanca)."},
        {"text": "You are not a lottery ticket."},
        {"text": "Already successful people either due to connections, money or position have an easier time creating new things. But do not be too quick to dismiss anyone who claims to have succeeded according to plan."},
        {"text": "An indefinite pessimist looks out onto a bleak future but he has no idea what to do about it (Europeans kicking the can down the road). A definite pessimist believes the future can be known, but since it will be bleak, he must prepare for it (Chinese who are obsessed of things getting worse). To a definite optimist, the future will be better than the present if he plans and works to make it better (US pre 1980s). To an indefinite optimist, the future will be better but he does not know how exactly so he will not make any specific plans (US post 1980s)."},
        {"text": "On biotech, few people commit to a specific company with the level of intensity necessary for success. So, it is difficult to know whether product failure is due to the inherent difficulty of biology or due to most biotech startups indefinite approach to business."},
        {"text": "Darwinist connotations are not proper metaphors for business. Darwinian evolution is equivalent to progress without planning, just random iterations over and over again until something works. But iteration without a bold plan will not take you from zero to one. A company is the strangest of places for an indefinite optimist: why should you expect to succeed without a plan to make it happen? In business, intelligent design works best."},
        {"text": "You are told that you are supposed to listen to what customers say they want, make nothing more than a mime viable product and iterate your way to success. But leanness is a methodology, not a goal. Small changes will not get you to a global maximum, at best they will lead you to a local maximum."},
        {"text": "The power of planning explains why valuing companies is hard and why you will probably pay either too much or too little. If founders only sell when they have no more concrete visions for the company, you will end up paying too much. Definite founders with robust plans do not sell, which means that the offer was not high enough."},
        {"text": "Good definite plans businesses will always seem underrated in a world where people see the future as random. A startup is the largest endeavour over which you can have definite mastery. You can have agency over a small but important part of the world by rejecting the uncanny tyranny of Chance."},
        {"text": "Venture capital returns follow a power law as opposed to a normal distribution. The biggest secret in venture capital is that the best investment in a successful fund equals or outperforms the entire rest of the fund combined. Thus every single company in a venture portfolio must have the potential to succeed at vast value. Extreme diversification likely leads to missing the very few companies that will become overwhelmingly valuable. Even the best investors have a portfolio, but those who understand the power law make as few investments as possible."},
        {"text": "It is probably more profitable to join a would be successful startup than to build one yourself since the very nature of power law makes differences between companies to dwarf differences in roles inside companies."},
        {"text": "One market will probably be better than others, one distribution channel will be better than others, even some moments in time will be much more significant than others. You cannot afford not to think about where your actions fall on the curve defined by the power law."},
        {"text": "What important truth do very few people agree with you on?"},
        {"text": "Every correct answer is necessary a secret to what valuable company is nobody building? Something that is important and unknown, hard to do but doable."},
        {"text": "Why has so much of our society come to believe that there are no hard secrets left? Forty years ago, people were more open to the idea that not all knowledge was widely known. We have given up our sense of wonder at secrets left to be discovered. The actual truth is that there are many more secrets left to be find, but they will yield only to relentless searchers."},
        {"text": "Secrets of nature (study the physical world) and secrets about people, which are things people do not know about themselves or do not want others to know."},
        {"text": "If you find a secret, what you do? You tell only whoever you need to. This group (a golden mean) is called a company."},
        {"text": "Thiel says a startup messed up at its foundation cannot be fixed. Bad decisions made early on, like hiring the wrong employees or teaming up with the wrong partners, are very hard to correct and may take a crisis on the order of bankruptcy before anyone attempts to correct them. As a founder, you need to get the first things right."},
        {"text": "High cash compensation teaches workers to claim value from the company as it already exists instead of investing their time to create new value in the future. But it is also important to remember that everyone not drawing a salary or having stock options is seriously misaligned."},
        {"text": "Company culture does not exist apart from the company itself, no company has a culture, every company is a culture. A startup is a team of people on a mission and a good culture is just what that looks like on the inside."},
        {"text": "From the outside, everyone in your company should be different in the same way (that is you are a cult and the rest of the world is not in your cult). On the inside, every individual should be sharply distinguished by her work (especially since job roles are highly fluid in startups, you do need to be facing with competition issues amongst the team)."},
        {"text": "The best startups might be considered slightly less extreme kinds of cults. The biggest difference is cults are fanatically wrong about something important, while successful startups are fanatically right about something important that those outside have missed."},
        {"text": "All salesman are actors, their priority is persuasion not sincerity. Sales work best when hidden. That is why almost everyone involved in distribution (sales, marketing or advertising) has a job title that has nothing to do with those things. People who sell advertising are called account executives, people who sell customers work are business developers. These who sell companies are investment bankers and those who sell themselves are called politicians. Redescriptions are necessary because none of us wants to be reminded when we are being sold."},
        {"text": "Think of distribution as something essential to product design. No matter how good the product is, if you have not invented an effective way to sell it you have a bad business."},
        {"text": "Customer lifetime value (total net profit earned on average over the course of your relationship with a customer) and Customer acquisition cost (amount spent on average to acquire a new customer) set the limits for effective distribution. Recall, distribution is the hidden bottleneck."},
        {"text": "Complex sales (seven figures or more) start small and once you have a pool of reference customers you can begin the long and methodical work of hustling toward bigger deals. Personal sales (five to six figures) require to establish a process for a sales team of modest size to move the product to a wider audience."},
        {"text": "If you can get just on distribution channel to work, you have a great business. If you try for several and do not nail one, you are finished."},
        {"text": "Everybody has a product to sell - no matter whether you are an employee, a founder, or an investor. It is even true if your company consists of just you and your computer. Look around, if you do not see any sales-people, then you are the salesperson."},
        {"text": "The most valuable business of coming decades will be built by entrepreneurs who seek to empower people rather than try to make then obsolete."},
        {"text": "Globalisation means substation, technology means complementarity."},
        {"text": "Recruiting is part detective work, part sales. You have to scrutinise applicants' history, assess their motives and compatibility and persuade the most skilful ones to join your company."},
        {"text": "How can computers help humans solve hard problems?"},
        {"text": "Strong AI is like a cosmic lottery ticket, if we win we get utopia, if we lose we get obliterated by robots."},
        {"text": "Seven questions that every business need to answer, (1) can you build a product (with proprietary technology) that is at least 10x better than the closest substitute (must offer customers transparent superiority), (2) is it now the right time to start your particular business (depends on the industry momentum), (3) are you starting with a big share of a small market so that you can have a monopoly over it (do not be too quick to define your market as thin as possible), (4) do you have the right team (this is one of the early decisions you have to make right), (5) can you deliver you product (remember distribution matters as it is at least as important as the product itself), (6) is your market position defensible during the next 10-20 years (ask yourself how the world is going to change over that period, how your company will fit in) and (7) great companies have secrets, reasons for success that other people do not see (have you identified a unique opportunity that others have missed)"},
        {"text": "Whatever the macro-world, only a company that starts from the micro-perspective and makes a superior product for a particular solution can make money. Find a niche market and dominate it."},
        {"text": "Founders resemble Romulus (who killed Remus). A law-maker and law-breaker, criminal king who defined Rome, self-contradictory insider/outsider. Founders are like him and are also scapegoats. They have the power and attention, it is their fault or doing."},
        {"text": "The lesson for business is that we need founders who can lead companies beyond mere incrementalism. Be more tolerant of founders who seem more strange or extreme than usual."},
        {"text": "The lesson for founders is that individual prominence and adulation can not be enjoyed except on the condition that it might be exchanged for individual notoriety and demonisation at any moment, so be careful."},
        {"text": "On future: Singularity or stagnation. Four possible scenarios, recurring collapse, plateau, extinction or takeoff. The first seems unlikely, the third might follow the second. The fourth is hard and requires exponential growth in tech and across other sectors. The most dramatic version of it is Singularity. But the future will not happen on its own. Think for yourself to recreate the world and bring the future."}
            
    ]
}